{"id":61100,"name":"Droidcon NYC 2016","description":"","locationName":"Convene Old Slip","startDate":"09/29/2016 08:00AM","endDate":"09/30/2016 06:00PM","venues":[{"id":71950,"name":"Down","description":"","mapImageUrl":"","events":[{"id":72022,"name":"@Eliminate(\"Boilerplate\")","description":"Java programming involves a good bit of boiler plate code. Everyone knows that. But it also has some great features to help mitigate this.\r\n\r\nCompile time annotation processing allows developers to hook into the compile phase of a Java program and do all sorts of things. By processing annotated source code, developers can generate code to automate repetitive tasks, clean up the development source, or just make Java easier to deal with.\r\n\r\nThere are many benefits to compile time annotation processors, one of the biggest being reducing runtime dependencies by only generating code that is needed.\r\n\r\nIn this talk, I’ll briefly introduce attendees to Java annotations, and show how they’re processed. I’ll show some examples of where this can be useful for reducing repetitive processes, and build a simple annotation processor.\r\n","category":null,"startDate":"09/29/2016 02:20PM","endDate":"09/29/2016 03:00PM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":47101,"name":"Ryan Harter","profile":"I'm a freelance Android developer, and Google Developer Expert.  I've been developing Android apps since 2009, and have built many notable apps like Marvel Unlimited, American Idol, Fragment, and many more.\r\n\r\nI specialize in consumer apps, and make Open GL based photo editing apps.","avatarKey":"https://lh3.googleusercontent.com/-lkykUe4Z8h4/AAAAAAAAAAI/AAAAAAAAYFI/rFUmyjCEPrQ/s96-c/photo.jpg","userCode":"a78f1","company":"Analog Ocean","twitter":"rharter","linkedIn":"https://www.linkedin.com/in/ryanharter","website":"ryanharter.com","email":"ryanjharter@gmail.com","phone":"7152049699","phoneticName":null,"gPlus":"https://plus.google.com/+RyanHarter/posts","nickname":null,"coverKey":null,"facebook":null,"emailPublic":true,"following":false}]},{"id":72027,"name":"Realm - A New Easy to Use Mobile Database & Object Framework","description":"So you need to store data in your mobile application? Great, now you need to work with SQLite. Writing SQL is great fun if you enjoy thinking about mapping your objects to a relational store over and over and over. But what if there was another solution? One that allowed you to work with objects and store them as such with a powerful query system. No transformations back and forth to a relational store. Well, you’re in luck, one does exist: Realm. Realm is a mobile object (MVCC) database that can do all of these things and more. In this session learn how you can rid yourself of SQL, SQLite and its binding chains so you can harness the power and speed of working with native objects in Realm.`","category":null,"startDate":"09/30/2016 11:40AM","endDate":"09/30/2016 12:20PM","publicEvent":true,"rsvpCount":6,"speakers":[{"id":62204,"name":"Donn Felker","profile":"Donn is an independent consultant with a focus on mobile and back-end server side technologies. He’s the co-host of the Fragmented Podcast – an Android Developer podcast. He’s a best-selling mobile development book author, international speaker and the lead instructor at Caster.IO – a bite-sized training site for Android Developers. You can learn more about him at his website – www.donnfelker.com or follow him on twitter @donnfelker.","avatarKey":"https://lh4.googleusercontent.com/-T3h_BngEl-M/AAAAAAAAAAI/AAAAAAAAr-c/pftIG_x6-fo/s96-c/photo.jpg","userCode":"e3101","company":"Independent Consultant at American Express","twitter":"donnfelker","linkedIn":"https://www.linkedin.com/in/donnfelker","website":"http://www.donnfelker.com","email":null,"phone":null,"phoneticName":null,"gPlus":"http://plus.google.com/+DonnFelker","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72016,"name":"Developing Apps for Daydream and Project Tango ","description":"Starting an App with a Virtual or Augmented reality component is a bit daunting for most. When starting out, frameworks like Unity3D or Unreal Engine simplify a great many things.\r\n\r\nBut, from an Android developer perspective, you need to forget all about the nice APIs and libraries you're used to. You'll need to shoehorn your business logic in frameworks that are designed to build games first, not apps -- not a great proposition.\r\n\r\nLet's explore the path less traveled together! In this session, we'll see how you can build VR and AR applications, in Java and Android Studio, thanks to Google's Daydream and Tango Java SDKs, plus a few helpful 3D graphics libraries.","category":null,"startDate":"09/29/2016 01:30PM","endDate":"09/29/2016 02:10PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":42150,"name":"Etienne Caron","profile":"Etienne is a software developer who's worked on all tiers (server, web, mobile and embedded) of large scale software platforms. He is now a Mobile Dev Lead for Shopify.\r\n\r\nEtienne has been an active member of the Android developer community in Montreal since 2010, and regularly devotes his time to mentoring startups, developers and students in the mobile space. Mentoring has included various subjects, such as client-server architecture, Android design patterns, continuous integration, software development methodologies and general software design. As part of the Montreal Android GDG, he organises meet-ups, hackathons, and gives regular talks on Android-related subjects.\r\n\r\nPreviously, Etienne worked on projects ranging from high-availability stock trading software platforms, all the way to large scale municipal bike sharing systems (London's cycle Hire amongst others). He lives in Montreal with his wife and daughter, and speaks French and English fluently.","avatarKey":"e1e9ae5a-effa-4223-9ba6-0fd759b0bb6f","userCode":"b4b43","company":"Shopify","twitter":"kanawish","linkedIn":"https://www.linkedin.com/in/etcaron","website":"http://shopify.com","email":null,"phone":null,"phoneticName":null,"gPlus":"plus.google.com/+etiennecaron","nickname":null,"coverKey":"136a0b42-0af5-44bd-8c59-76ede28e9878_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72008,"name":"How LayoutInflater works","description":"Last year Michael ( @yogurtearl ) told you \"How the Main Thread works\", this year he explains \"How  LayoutInflater works\"\r\n\r\nDiscussion will include: \r\n- How Layout XML file become view hierarchies\r\n- How LayoutInflaters are used in AppCompat \r\n- *new* AsyncLayoutInflater in v24 of support-v4","category":null,"startDate":"09/30/2016 09:10AM","endDate":"09/30/2016 09:50AM","publicEvent":true,"rsvpCount":19,"speakers":[{"id":15711,"name":"Michael Bailey","profile":"Michael is a Google Developer Expert and a Senior Staff Engineer on the Android team responsible for American Express’ flagship consumer Android apps in the U.S. market. Development on these apps began in 2010. Since joining the company in 2008, Michael has worked on a number initiatives at American Express including analytics, enterprise content management, AmexLabs, iOS apps, international mobile applications, NFC payments, the U.S. homepage and the U.S. online card applications site. Michael holds a BS in Computer Science from Harvey Mudd College and an MS in Computer Science from the University of Southern California, where he specialized in computer security. Including the U.S. consumer apps that Michael works on, American Express has 8 Android apps in the U.S. Google Play Store (https://play.google.com/store/apps/developer?id=American%20Express) and more in the international Play Stores.","avatarKey":"da8a4c5f-76bb-4532-89c6-14f1a6b5a8cd","userCode":"31e6","company":"American Express","twitter":"yogurtearl","linkedIn":"https://www.linkedin.com/in/michaeljbaileyyogurtearl","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72025,"name":"The Jack and Jill build system","description":"The Android SDK now contains the experimental Jack and Jill compilers. Like the traditional Java and Dex compilers, they still translate Java source code to Dalvik bytecode, so at some level, it may seem like a small change.\r\n\r\nIn this presentation, I'd like to discuss the implications for developers. How can you start using the compilers? What are the advantages? Are there any disadvantages? I'll also provide some insight in the underlying technology, such as the Gradle build process and the new Jayce bytecode representation, which may impact the Android ecosystem more profoundly.\r\n","category":null,"startDate":"09/30/2016 10:00AM","endDate":"09/30/2016 10:40AM","publicEvent":true,"rsvpCount":9,"speakers":[{"id":42600,"name":"Eric Lafortune","profile":"Eric is the creator of the open-source optimizer and obfuscator ProGuard, and its commercial extension DexGuard. He is obsessed with making applications more compact, more efficient, and better protected against attacks. He is the founder and CTO of GuardSquare, where they put this obsession to good use.","avatarKey":"User_030952f9-768c-40c5-b58c-2b262287e0b0","userCode":"1dd05","company":"GuardSquare","twitter":"GuardSquare","linkedIn":"www.linkedin.com/in/ericlafortune","website":"www.guardsquare.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72028,"name":"Mastering Material Motion","description":"One of the foundations of Material Design is Motion.  Effective motion can be used to provide user feedback, guide interaction focus, establish visual relationships between elements, and provide important polish and delight.\r\n\r\nCreating apps with effective motion hasn't always been simple, but I have learned some techniques to make it easy.  Come to this session where I will show you how to use touch feedback, transitions and animations to make your applications come alive with effective motion and be more enjoyable for your users.\r\n\r\n","category":null,"startDate":"09/30/2016 01:30PM","endDate":"09/30/2016 02:10PM","publicEvent":true,"rsvpCount":6,"speakers":[{"id":25861,"name":"Mike Wolfson","profile":"Mike is a passionate mobile designer/developer working out of Phoenix. He has been working in the software field for more than 20 years, and with Android since its introduction. Currently, he develops Android applications for an IoT startup, in the automotive and payments space. He is a Google Developer Expert in Android, and the author of the book “Android Developer Tools Essentials” published by O’Reilly.Mike has spoken about Android and mobile development at a variety of conferences and user groups (including Oscon, AnDevCon, GDGSv, Droidcon Turin, and others). When he is not geeking out about phones, he enjoys the outdoors (snowboarding, hiking, scuba diving), collecting PEZ dispensers, and chasing his young (but quick) daughter.","avatarKey":"User_80f3d465-972b-4088-800a-147fc01b414e","userCode":"f3b7","company":"Able Android LLC","twitter":"mikewolfson","linkedIn":"https://www.linkedin.com/in/mswolfson","website":"http://www.mikewolfson.com","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/u/0/+MichaelWolfson","nickname":null,"coverKey":"3c6f13c9-b34d-4976-bb52-2d0ba0310592_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72015,"name":"Advanced Data Binding in Practice","description":"Data Binding is an great way to make your code cleaner and more maintainable. This talk will start with a quick crash course for beginners, then focus on the many new features that Google has added since the announcement of data binding at I/O 2015, including:\r\n\r\n- Two-way data binding\r\n- Expression chaining\r\n- Implied event updates\r\n- Method references and lambda expressions\r\n- Magic variables\r\n- Animation support\r\n- Dependency injection support\r\n\r\nI will demonstrate how these new features will save you time in practice with sample apps created specifically for the talk that you can find on Github.","category":null,"startDate":"09/30/2016 04:00PM","endDate":"09/30/2016 04:40PM","publicEvent":true,"rsvpCount":7,"speakers":[{"id":13512,"name":"Jacob Tabak","profile":"Although he currently is a resident of Wisconsin, Jacob has been an active member of the NYC Android community since he began working at Timehop in 2013.\r\n\r\nHe's since transitioned to DramaFever (also in NYC), but his passion for writing apps that users love has been a constant throughout his career.\r\n\r\nJacob is a frequent conference speaker and is looking forward to making his third appearance at Droidcon NYC.","avatarKey":"107861e5-c61a-4b62-bee6-c33b22155f51","userCode":"53bf","company":"DramaFever","twitter":"JacobTabak","linkedIn":null,"website":"http://jacob.tabak.me","email":null,"phone":null,"phoneticName":null,"gPlus":"+JacobTabak","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72013,"name":"Mutative design: What's New with Project Phoebe","description":"Project Phoebe (phoebe.xyz) is the first step toward mutative design - a new design methodology that would allow interfaces to be born, live, and evolve according to a user's reality.\r\n\r\nIt's an idea that looks to solve the problem of designing for averages, and create interfaces that account for all users.\r\n\r\nIn this session, we'll take a look at the latest developments in Project Phoebe - from the theory behind successful mutations to the ways in which our perception of software's abilities and responsibilities will change as we continue to move toward a future where software helps users by knowing them.","category":null,"startDate":"09/29/2016 04:00PM","endDate":"09/29/2016 04:40PM","publicEvent":true,"rsvpCount":6,"speakers":[{"id":25871,"name":"Liam Spradlin","profile":"I'm Liam Spradlin, a visual designer working on the web, iOS, and Android. In the past few years I've worked in both agency and freelance contexts with clients including GE Appliance, the National MS Society, and a number of independent developers with apps like Nova Launcher, AllCast, and Today Calendar, creating compelling interfaces, experiences, print layouts, and visual assets. My approach with any design, whether it's a brand new product yet to be shaped, or an existing one with millions of users, is to figure out the essentials - what does it do? What does the audience expect? How can we best facilitate the former and satisfy the latter? I like to explore areas where designs can delight their audiences in invisible ways, and I think there are tons of these opportunities in modern design, especially on mobile devices. My main hobby is also my work - whether it's typography, interface, or illustration, most of my free time is spent designing. Outside of that, I'm a freelance photographer (most recently shooting the Kentucky Derby for Churchill Downs), a writer, and - occasionally - a glass blower.","avatarKey":"http://static.sched.org/a6/2148006/avatar.jpg.320x320px.jpg?c5e","userCode":"5d42","company":"touchlab","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72023,"name":"Stealing the Web’s Best Feature","description":"Square Cash recently moved some core business logic out of Java and into an embedded scripting language. This allows the web, iOS, and Android clients to share the same code, as well as update that logic on the fly without requiring an app update. Learn the background behind this decision, how we leverage the technology on Android, and how you can do the same with your app.","category":null,"startDate":"09/29/2016 04:50PM","endDate":"09/29/2016 05:30PM","publicEvent":true,"rsvpCount":14,"speakers":[{"id":14015,"name":"Matt Precious","profile":"Lead developer of Square Cash for Android in Waterloo, Canada. Contributor to several open source projects including Telescope, Whorlwind, Swirl, and u2020.","avatarKey":"http://static.sched.org/a6/1414165/avatar.jpg.320x320px.jpg?62e","userCode":"ebac","company":"Square, Inc.","twitter":"mattprec","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"e1f58534-01df-4e33-b05f-3d1e1a9c61a0_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72020,"name":"Android for All","description":"\r\nAndroid is the most popular operating system in the world and growing rapidly. Emerging markets are important, but not the only reason to write the most performant app possible. Building solutions that serve all of your customers will become increasingly more important. I will share what I've learned over the last year while writing apps to install solar systems in rural Tanzania. You will learn strategies for shaping your architecture, how to make your app work well offline, how to keep your APKs trim, and how to set up your test labs and conditions.","category":null,"startDate":"09/29/2016 03:10PM","endDate":"09/29/2016 03:50PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":12815,"name":"Corey Latislaw","profile":"Corey Leigh Latislaw is an Android Google Developer Expert (GDE) who has written several high-profile Android applications at companies large and small. By day, she writes applications that work flawlessly offline to help OffGrid Electric power a million homes in Africa. At night, she authors videos and books on Android programming, runs an Android consulting firm, and organizes the Philadelphia GDG. She is passionate about sketchnoting, travel, local food, the outdoors, and photography.","avatarKey":"http://static.sched.org/a6/1411638/avatar.jpg.320x320px.jpg?6e8","userCode":"4b65","company":"Green Life Software Development","twitter":"corey_latislaw","linkedIn":"linkedin.com/in/coreylatislaw","website":"coreylatislaw.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72031,"name":"Supercharging your Android app release with fastlane","description":"How would you like 2 extra hours of your time back every week? All Android app developers face similar workflows as they work to upload an app to Google Play. Many of these processes are currently done manually, but why not automate them? Fastlane makes building, testing, and releasing your app faster, reproducible and less troublesome, leaving developers more time to focus on feature code and not deployment! Learn how you can automate the tedious tasks to generate release notes, screenshots, submit betas and push your final submission straight to the Google Play portal effortlessly from your command line with a powerful open source tool.","category":null,"startDate":"09/29/2016 09:50AM","endDate":"09/29/2016 10:30AM","publicEvent":true,"rsvpCount":7,"speakers":[{"id":24403,"name":"Andrea Falcone","profile":"Andrea Falcone is a senior software engineer at Twitter, working on the Beta by Crashlytics and the Fabric platform. She has developed for the Fabric and Crashlytics Android SDKs and tools (plugins for Ant, Maven, Gradle, IntelliJ, Android Studio and Eclipse!) as well as the Beta by Crashlytics Android app.","avatarKey":"84b54ebb-aa67-4934-8e0e-831418a70331","userCode":"a318","company":"Twitter/Fabric","twitter":"asfalcone","linkedIn":"asfalcone","website":"fabric.io","email":null,"phone":null,"phoneticName":null,"gPlus":"asfalcone","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72009,"name":"Pushing Android’s Boundaries For Pinterest’s New Look","description":"Creating designs and experiences that are consistent across different platforms and device factors can result in increased complexity for both design and engineering. One way to reduce the complexity is to create a design system that provides reusable building blocks and consistent guidelines. A design system may include guidelines for how components should be spaced or sized, typography, color scheme or how animations should behave. At Droidcon Berlin [link: http://droidcon.de/sessions/pushing-boundaries-layout-system-and-typography], we shared details about the explorations and concrete solutions to meet the layout and typography requirements of Pinterest’s design system.\r\n\r\nThis talk will (briefly) introduce the core layout and typography components and will then cover details on the process that we went through to productionize them. In particular, this will touch on measuring and refining performance as well as improving the components based on product engineer’s feedback.  \r\n\r\nThe second part of the talk will go into detail about the design system’s tap and screen animation requirements. Instead of UI components having to be aware of tap animations, we abstracted the animations into the core layout components in order to reduce the friction and make it easier to provide a consistent experience throughout our app. The talk will then cover how we pushed the envelope on animations given that the majority of our screens are fragments.\r\n\r\nYou will leave this talk with a deepened understanding of the layout system, typography and custom animations. The layout system is at the core of how views are inflated and a powerful tool for system wide view modifications. Typography and animations can set your application apart via pleasant appearances and through unique interactions.","category":null,"startDate":"09/29/2016 10:40AM","endDate":"09/29/2016 11:20AM","publicEvent":true,"rsvpCount":6,"speakers":[{"id":66055,"name":"Thorben Primke","profile":"Software Engineer at Pinterest working towards making all product pins buyable. \r\nPrior to Pinterest, Thorben has worked on Android at Jelly, Facebook and Gowalla.","avatarKey":"https://lh6.googleusercontent.com/-SatYik1_Ifs/AAAAAAAAAAI/AAAAAAAAAAw/gWUB7SLfqus/s96-c/photo.jpg","userCode":"dac21","company":"Pinterest","twitter":"tprimke","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":77457,"name":"Lin Wang","profile":"","avatarKey":"User_4e05a444-7c64-4557-b8ac-f241dc1caf1e","userCode":"","company":"Pinterest","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72044,"name":"How to Build a Material Icon: The Basics (Workshop)","description":"Google has provided a detail set of guidelines for the creation of Material product icons and yet it remains a confusing endeavor. In this workshop we'll run through the creation of a simple product icon step by step. We'll demystify the guidelines and learn about its inaccuracies and undocumented aspects including longshadows, and exporting for production. Experience with vector design software recommended but not required. This workshop will use Figma (http://figma.com) a full capability browser-based design tool (think web-based Sketch). You don't need an existing account to take this class.","category":null,"startDate":"09/29/2016 05:40PM","endDate":"09/29/2016 06:20PM","publicEvent":true,"rsvpCount":4,"speakers":[{"id":61307,"name":"Michael Cook","profile":"Icon and interface designer from small-town Iowa. I've been exploring Google iconography since 2010, back before Project Kennedy, Holo, and Material Design. I've been doing freelance Material product icon design basically since Matias announced the design system at I/O.","avatarKey":"https://lh5.googleusercontent.com/-R5G0fJ8O-pw/AAAAAAAAAAI/AAAAAAAB01I/P5qs6SSJvWM/s96-c/photo.jpg","userCode":"a4dfb","company":"Cookicons","twitter":"mcookcie","linkedIn":"","website":"http://cookicons.co","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":75203,"name":"Integrating SDKs - secrets, strategies, and automated performance testing","description":"Building a successful mobile app today requires more than just writing and worrying about your own code. The Android ecosystem has exploded with hundreds of services to help you manage your mobile app data and business, and many of those services provide SDKs. As Android developers it's up to you to evaluate these SDKs before letting them into your app.\r\n\r\nThough SDKs may be a necessity - it's up to you to build an approach to SDKs that optimizes your app quality, while minimizing the time you spend maintaining each SDK. What's in a typical SDK? Can I read its source? What are the privacy implications? What are the memory, network usage, and other performance implications of adding it?  This talk will give an overview of data and SDK strategies, enumerate common Android app performance and quality impacts, and discuss automated test tooling that you can integrate to analyze SDK impact and build better apps.","category":null,"startDate":"09/30/2016 10:50AM","endDate":"09/30/2016 11:30AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":77458,"name":"Sam Dozor","profile":"Sam's been building Android apps and advocating for the Android platform since the Donut days. Working for startups, he's felts the pain that other startup developers feel - small team, constrained for resources, and always wanting to move faster, but with a pride for app quality and customer-experience. Now leading mobile development at mParticle, a mobile app platform reaching over 500 million devices, Sam focuses on building developer tools that make developers' lives easier in the exploding mobile app service ecosystem. He's evaluated hundreds of mobile app services in the mobile app ecosystem and is here to share what he's learned, and is always on the lookout for what developers need to build better apps.","avatarKey":"User_4e845d48-51f9-4753-8aaf-e2ac071257df","userCode":"","company":"mParticle","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72109,"name":"Actionable insights with Fabric","description":"Todd will talk about new features in Fabric that provide information about where you should invest next at both a tech and business level. New dashboards and information that'll help you find a clear path to stability and growth!","category":null,"startDate":"09/29/2016 09:00AM","endDate":"09/29/2016 09:40AM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":70100,"name":"Todd Burner","profile":"Todd is a developer advocate at Twitter and focuses in the mobile tools Fabric and Fastlane. Prior to Twitter he worked at Google and had his own company. He's deeply interested in futurology.","avatarKey":"User_1d18abfb-c1c8-44b1-acf0-5820495bc272","userCode":"","company":"Twitter","twitter":"toddlovesthis","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72004,"name":"Animatable","description":"A deep dive on designing and building animations and transitions to bring beautiful, meaningful motion into your apps.","category":"Dev/Design","startDate":"09/30/2016 03:10PM","endDate":"09/30/2016 03:50PM","publicEvent":true,"rsvpCount":14,"speakers":[{"id":30903,"name":"Nick Butcher","profile":"Nick is an Android designer & developer who helps other designers and developers to understand and create beautiful material design apps.","avatarKey":"a84e76d8-ba63-4962-a804-d564ff06603e","userCode":"0802b","company":"Google","twitter":"crafty","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":"NickButcher","nickname":null,"coverKey":"b323f6f1-a634-43d9-b470-e4f42d9acae1_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72108,"name":"WTF SMS 2FA?","description":"SMS is by far the most common method of delivering a 2FA token to the user. Unfortunately, it's also the least secure way to deliver a 2FA token. In this talk we'll discuss the necessity of 2FA, the benefits and weaknesses of several 2FA methods, and how to add push based 2FA verification to your Android apps for a much more secure and seamless experience for your users.","category":null,"startDate":"09/30/2016 02:20PM","endDate":"09/30/2016 03:00PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":70850,"name":"Greg Baugues","profile":"Greg serves as a developer evangelist at Twilio and lives in Carroll Gardens with his wife, daughter, and their selfie texting dog.","avatarKey":null,"userCode":"","company":"Twilio","twitter":"greggyb","linkedIn":"","website":"https://www.twilio.com/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":71952,"name":"Left","description":"","mapImageUrl":"","events":[{"id":72002,"name":"Looking Ahead to RxJava 2","description":"Development on the next major version of RxJava is underway. While the operators remain largely unchanged, Observable creation, subscription management, and backpressure has been completely overhauled in this new version.\r\n\r\nThis talk will be an exploration on not only what has changed but also the reasons behind why these changes were made. We'll also talk about how both libraries and applications can migrate to supporting RxJava 2 as well as interop between the two versions.\r\n\r\nNo prior knowledge of RxJava is strictly required, although concepts, terms, and comparisons will be made that do assume some prior knowledge.","category":null,"startDate":"09/29/2016 02:20PM","endDate":"09/29/2016 03:00PM","publicEvent":true,"rsvpCount":21,"speakers":[{"id":5662,"name":"Jake Wharton","profile":"Jake Wharton is an Android developer at Square working on Square Cash. He has been living with a severe allergy to boilerplate code and bad APIs for years and speaks at conferences all around the world in an effort to educate more about this terrible disease.","avatarKey":"http://static.sched.org/a4/1356595/avatar.jpg.320x320px.jpg?ea8","userCode":"6d59","company":"Square, Inc.","twitter":"JakeWharton","linkedIn":"","website":"http://jakewharton.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72042,"name":"Embracing SQL Without Abstraction","description":"SQL Delight and SQL Brite are two libraries for SQLite which allow you to populate complex, reactive UIs efficiently and with minimal boilerplate. This talk will start with a brief history on why we chose to build our own SQLite libraries and an IntelliJ plugin at Square, what problems they do and do not solve, example usage, and finally what we plan on building next within SQL Delight.","category":null,"startDate":"09/30/2016 03:10PM","endDate":"09/30/2016 03:50PM","publicEvent":true,"rsvpCount":8,"speakers":[{"id":61400,"name":"Alec Strong","profile":"Android developer on Square Cash, creator of SQLDelight, uWaterloo grad, super smash bros melee competitor.","avatarKey":"https://lh4.googleusercontent.com/-eC99vA4gpcg/AAAAAAAAAAI/AAAAAAAAAB8/Q9oOoUnvfPg/s96-c/photo.jpg","userCode":"8c21d","company":"Square, Inc.","twitter":"Strongolopolis","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72018,"name":"Window content transitions explained","description":"The Android window content transitions API is key when it comes to guide user attention through an application. This session will give an introduction into the API as well as provide tips and tricks when it comes to applying it.","category":null,"startDate":"09/29/2016 09:50AM","endDate":"09/29/2016 10:30AM","publicEvent":true,"rsvpCount":11,"speakers":[{"id":64952,"name":"Ben Weiss","profile":"Ben is a Developer Programs Engineer on the Android Developer Relations team.\r\nHe focuses on making Android apps more delightful.","avatarKey":"https://lh5.googleusercontent.com/-b8Oxh-bDUMI/AAAAAAAAAAI/AAAAAAABFkg/NDBf0uFfP_g/s96-c/photo.jpg","userCode":"4d980","company":"Google","twitter":"keyboardsurfer","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":"+BenjaminWeiss","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72026,"name":"Multi-threading, concurrency and async on Android","description":"Multi-threading and concurrency is one of the most difficult challenges in software development. When writing apps for Android, this has proven to be even more of a challenge because the way the framework and APIs are designed. In this session we will look at why this is so difficult, take a deep dive into how threading is implemented on Android and finally how developers can make their work easier by gaining a better understanding of threads work on Android and the tools and APIs available. This session will not require any existing knowledge about threads, RxJava, java.util.concurrent or any other concurrency or asynchronous API.","category":null,"startDate":"09/30/2016 10:50AM","endDate":"09/30/2016 11:30AM","publicEvent":true,"rsvpCount":10,"speakers":[{"id":42350,"name":"Erik Hellman","profile":"Author of \"Android Programming: Pushing the Limits\". Previously worked as lead architect for Sony Mobile, Android Developer at Spotify and is currently working as a freelancing Android consulting in Stockholm, Sweden.","avatarKey":"https://lh6.googleusercontent.com/-oJpcO17Ss4c/AAAAAAAAAAI/AAAAAAAAVBU/EVonbx73Qu4/s96-c/photo.jpg","userCode":"832e4","company":"Hellsoft","twitter":"ErikHellman","linkedIn":"https://se.linkedin.com/in/erikhelllman","website":"http://hellsoft.se","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+ErikHellman/posts","nickname":null,"coverKey":null,"facebook":"https://www.facebook.com/ErikHellman","emailPublic":false,"following":false}]},{"id":72021,"name":"A Journey Through MV Wonderland","description":"Developing an app with a design that changes every few months means that the architecture chosen for the UI has to facilitate change. How do you react fast to UI changes, with minimum amount of code? What pattern is the best for testability? Which pattern gives you most decoupling of classes? \r\n\r\nMVC, MVP and MVVM are the most popular architecture patterns for implementing user interfaces. Join me on a journey to discover the advantages and disadvantages associated with of each of these and find the best one. We will perform a deep dive into the implementations and tests for each pattern. Learn about the pitfalls that you can expect and how you can avoid them, based on some of the lessons that we have learned. ","category":null,"startDate":"09/29/2016 05:40PM","endDate":"09/29/2016 06:20PM","publicEvent":true,"rsvpCount":12,"speakers":[{"id":61420,"name":"Florina Muntenescu","profile":"Florina passionately works at upday as a Senior Android Developer. She has been writing code for more than 7 years, mostly for Android. Florina keeps a strong focus on clean code and UI/UX. Previous work covered payment solutions at payleven and navigation services at Garmin.","avatarKey":"User_2d4c57e7-29db-462c-91be-07e02f24b6bb","userCode":"b5cdb","company":"upday","twitter":"FMuntenescu","linkedIn":"https://de.linkedin.com/in/florina-muntenescu-314b8921","website":"http://upday.github.io","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72036,"name":"Close the Loop: Designing and Developing Together","description":"Whether you work as a developer or designer at a product company, as an independent contractor, or as part of a team of consultants, you will leave this session with new techniques to streamline your “dev+sign” process, making it a more enjoyable and effective experience for all.\r\n\r\nAt Big Nerd Ranch we’ve forged a process where Android developers and designers work hand-in-hand throughout the life of a project to support each other in creating the most awesome Android app possible.  We will walk you through real examples from the trenches (names will be changes to protect the innocent!) and talk about what we learned from our mistakes.  \r\n\r\nFrom presenting a united front in advocating for standard Android conventions, to creating a shared language for common elements to reduce code redundancy and prevent a rat’s nest of styles, we will share details about processes we follow to solve problems we have faced in creating apps for clients.  ","category":null,"startDate":"09/29/2016 03:10PM","endDate":"09/29/2016 03:50PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":61300,"name":"Kristin Marsicano / Zack Simon","profile":"Kristin Marsicano is an Android developer at Big Nerd Ranch, and the co-author of Android Programming: The Big Nerd Ranch Guide.  Prior to working at Big Nerd Ranch, Kristin spent five years teaching introductory Computer Science courses at Georgia Tech.  Always an educator at heart, she is passionate about learning, software development, and the intersection of the two.  When she is not teaching or developing apps, you can find Kristin cooking for her growing family, doing yoga, or learning something new (like gardening).\r\n\r\nZack Simon is a UX/UI designer at Big Nerd Ranch, where he conducts user testing and designs web and mobile apps. He works closely with developers to deliver award-winning apps to clients around the globe. In his free time, Zack attempts to collect one of every Pokémon in the national dex.","avatarKey":null,"userCode":"f5fac","company":"Big Nerd Ranch","twitter":"kristinmars","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72030,"name":"Delighting Details - Animated Vector Drawables","description":"Vector Drawables are available since Lollipop and are now part of the Support Library. They bring a whole new range of possibilities when it comes to animation that can delight your users in many ways.\r\n\r\nIn this talk we're gonna go through what we can do to animate our vector drawables, how to implement them and support them in a wide range of android versions. We're gonna take a look at how we can do animations with path data as well as trimPath, how to choreograph them to achieve your desired animation.\r\n\r\nFinally, I'm gonna show how we can play with Vectors on sketch without being a rockstar design so we can create the vectors we need to achieve our animations. I'm gonna show how we can get a SVG from google's material design website and easily change it in Sketch to achieve a very animations using the concepts presented at the beginning.","category":null,"startDate":"09/30/2016 02:20PM","endDate":"09/30/2016 03:00PM","publicEvent":true,"rsvpCount":12,"speakers":[{"id":5690,"name":"Marcos Paulo Damasceno","profile":"Marcos is a passionate developer from Brazil who has been working with Android since 2010. He loves simple and beautiful UX and UI and is always focused on important small details and what makes mobile apps great. He is passionate about startups and tries his best to help early stage startups build great Android apps and awesome products. He is also a Google Expert in Android.\r\n\r\nMarcos is actively involved in the community, organizing the GDG in Montreal, speaking at many conferences around the world and being a mentor in events like Startup Weekends and various hackathons.\r\n\r\nSince moving to Montreal in 2013, Marcos has developed great apps for large companies and startups in Canada working for Mirego. One of those apps reached the global market with more than 500k downloads.","avatarKey":"http://static.sched.org/a6/1375294/avatar.jpg.320x320px.jpg?e0f","userCode":"e38c","company":"Mirego","twitter":"marcospaulosd","linkedIn":"https://www.linkedin.com/in/marcosdamasceno/en","website":"devforfun.com","email":null,"phone":null,"phoneticName":null,"gPlus":"+marcospaulosd","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72029,"name":"Fingerprint Authentication In Action","description":"Your users are asking for fingerprint authentication - deliver it!\r\n\r\nIn this session we'll discuss how to build a fingerprint-enhanced user flow on Android.  We'll review the options the framework gives you. You'll learn how to take advantage of them to allow users to log in, and secure sensitive flows like making a purchase or payment.\r\n\r\nWe'll explore this through an open source implementation of both an Android app and a simple backend that demonstrates the concepts being discussed.","category":null,"startDate":"09/30/2016 01:30PM","endDate":"09/30/2016 02:10PM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":30204,"name":"Ben Oberkfell","profile":"Ben is an Android developer at American Express.  \r\n\r\nPreviously, he developed Android and iOS applications for Jive Software.  Before discovering mobile development, he worked on the Human Genome Project and cancer research projects writing data analysis tools.","avatarKey":"04109506-6e1f-42f7-acd4-3ecee5b13112","userCode":"25b28","company":"American Express","twitter":"benlikestocode","linkedIn":"http://LinkedIn.com/in/benoberkfell","website":"http://benlikestoco.de","email":null,"phone":"","phoneticName":null,"gPlus":"+BenOberkfell","nickname":null,"coverKey":"8ed7889b-500a-4cbb-9407-4021309c3d52_cover","facebook":"","emailPublic":false,"following":false}]},{"id":72005,"name":"Draggin' and Droppin'","description":"Android has had a drag-and-drop framework since Android 3.0. However, it has largely been ignored, since it only works between views on one activity, and there are only so many scenarios in which that might be useful.\r\n\r\nAndroid 7.0's multi-window support, though, makes drag-and-drop more interesting, as it can go between windows, even between apps. Users may expect apps to support drag-and-drop in multi-window modes, since some of  their desktop apps do.\r\n\r\nIn this talk, we will see how to implement Android's drag-and-drop support, both in a single activity and across applications. We will see how permissions make cross-application drag-and-drop a bit of a challenge to implement. And, we will explore alternatives to simple drag-and-drop, including how to offer accessible alternatives.","category":null,"startDate":"09/30/2016 09:10AM","endDate":"09/30/2016 09:50AM","publicEvent":true,"rsvpCount":3,"speakers":[{"id":5671,"name":"Mark Murphy","profile":"Mark Murphy is the founder of CommonsWare and the author of \"The Busy Coder’s Guide to Android Development\". He is active in supporting the Android developer community, from answering questions on Stack Overflow to publishing sample code and reusable components as open source.","avatarKey":"http://static.sched.org/a3/1049029/avatar.jpg.320x320px.jpg?bae","userCode":"d568","company":"CommonsWare, LLC","twitter":"commonsguy","linkedIn":null,"website":"http://commonsware.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":75300,"name":"Play Services Task API","description":"The new Play Services Task API launched with Play Services client 9.0.0, along with the Firebase client libraries for Android.  The Task API mirrors what's offered by many implementations of Promises used by popular programming environments. In this session, we'll take a look at what Tasks can do for your Android app when it comes to parallelization and concurrency.  Firebase happens to make great use of Tasks (as well as other Play Services components), so we'll examine some real use cases for Tasks with Firebase.  And we'll even implement a few Tasks of our own!","category":null,"startDate":"09/29/2016 04:50PM","endDate":"09/29/2016 05:30PM","publicEvent":true,"rsvpCount":4,"speakers":[{"id":62000,"name":"Doug Stevenson","profile":"Doug is a Developer Advocate at Google and experienced software engineer and public speaker.  He's been deeply involved with Android since 2009 and has published apps, built tools, and taught classes on a wide variety of Android-related topics.  Currently he works closely with the Firebase Crash Reporting and Firebase Test Lab for Android teams to help developers build high quality apps.","avatarKey":"https://lh5.googleusercontent.com/-aQIVFUNMEnY/AAAAAAAAAAI/AAAAAAAAALc/1rMaKxFYqDA/s96-c/photo.jpg","userCode":"d61dc","company":"Google","twitter":"CodingDoug","linkedIn":"https://www.linkedin.com/in/codingdoug","website":"http://firebase.google.com","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+DougStevenson1","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72107,"name":"Intro to Deep Linking on Android","description":"Android is an incredibly fragmented platform. Due to Google forcing device manufacturers to be responsible for porting the OS, requiring backwards compatibility, and supporting a multitude of supported devices. Deep linking on Android is no different. Over the years, we’ve seen a plethora of technical requirements that must be used depending on the circumstance and context of the user. Luckily, Branch ties all of these implementations together, creating a linking platform that works in every edge case. Branch links wrap and standardize all of this complexity, so you don’t need to worry about it. This session will summarize the various deep linking mechanisms that Branch employs, and explain how they work and are implemented. Focused on: - Facebook App Links (URI scheme based), Twitter App Cards - Chrome Intents (for Chrome and the 4.4+ webviews) - URI schemes (for Firefox and other browser) - Android App Links","category":null,"startDate":"09/29/2016 01:30PM","endDate":"09/29/2016 02:10PM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":28202,"name":"Evan Groth","profile":"A recovering hacker, Evan has been programming from day one. Evan built the ClassOwl app from blank screen to market in two short months. Evan recently joined Branch Metrics as a member of their evangelist team after building up his Android skills over several years, successfully launching TweetDreams and Excambio Android apps on the Google Play store.","avatarKey":"http://static.sched.org/a6/2199363/avatar.jpg.320x320px.jpg?c27","userCode":"2b0e","company":"Branch Metrics","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72010,"name":"Android Studio Like a Boss","description":"Mastering your IDE is a great way to become more productive. However, it seems like every blog post or video rehashes the same basic tricks. What is an advanced developer to do?\r\nIn this talk we will take a detailed look at powerful but lesser known features.\r\nWe will bend Structural Search&Replace to our will, we will develop our own Live Templates, we will force studio to interact with external tools and we will take a look at lesser known refactorings that you should be using.\r\nBecause remember, a productive developer is a happy developer!","category":null,"startDate":"09/30/2016 04:00PM","endDate":"09/30/2016 04:40PM","publicEvent":true,"rsvpCount":10,"speakers":[{"id":24405,"name":"Philippe Breault","profile":"Philippe is a software engineer at American Express and has been passionate about android since 2010.He worked on a wide variety of Android apps for newspapers, startups, television providers and more.He is a GDE (Google Developer Expert), one of the organizers of droidcon Montréal 2015 and is very active in the Montréal Android Community.","avatarKey":"http://static.sched.org/a6/2124577/avatar.jpg.320x320px.jpg?db4","userCode":"419e","company":"American Express","twitter":"pbreault","linkedIn":null,"website":"www.developerphil.com","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+PhilippeBreault/","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72038,"name":"Virtual Reality in Android or Daydreaming about Cardboards","description":"On this years IO Google announced Daydream, a new way of integrating your apps with Virtual Reality. \r\n\r\nTo prepare the audience for those new changes, I'll explain the current situation of the VR on Android by live coding two apps: An app using Unity to produce an App on Android and Ios, but also show how to write a simple photosphere app, written in pure Java, emphazising the differences and similarities between both SDKs.\r\n\r\nAfter showing how to easily write Cardboard Apps, I'll introduce Daydream, and how this specification changes the usage of the SDK and how to use the simulated, or real controller.","category":null,"startDate":"09/29/2016 09:00AM","endDate":"09/29/2016 09:40AM","publicEvent":true,"rsvpCount":8,"speakers":[{"id":56404,"name":"Mario Bodemann","profile":"Google Developer Group Co-Organiser in Berlin, Germany @Berlindroid\r\n\r\nAndroid and Java Evangelist @Contentful\r\nSoftware Engineer @Memorado and @HERE\r\nGraduate Software Engineer @Wooga\r\nResearch Associate @HHIFraunhofer","avatarKey":"fca86fe0-66cd-44cb-a435-968a684c5057","userCode":"45124","company":"Contentful","twitter":"MarioBodemann","linkedIn":"MarioBodemann","website":"www.contentful.com","email":null,"phone":null,"phoneticName":null,"gPlus":"+MarioBodemann","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72105,"name":"Persistent Queues with Tape","description":"The best apps don't make users wait. They dispatch tasks to the background.\r\n\r\nBut processing background tasks can be tricky. What happens if the device runs out of battery? What if the network is down?\r\n\r\nPersisting to disk helps you handle such edge cases. Enter Tape, a collection of queue related classes. This talk will primarily be about it’s core component, QueueFile — a lightning fast, transactional, persistent file-based FIFO. We'll dig into it's implementation and see how it guarantees both reliability and efficiency. And you'll learn to make the most of QueueFile with real world examples.","category":null,"startDate":"09/30/2016 10:00AM","endDate":"09/30/2016 10:40AM","publicEvent":true,"rsvpCount":6,"speakers":[{"id":16952,"name":"Prateek Srivastava","profile":"Prateek is a programmer at Segment working on the integrations platform. Outside of Android, he works with iOS, Go and more reluctantly, JavaScript. He's an open source enthusiast with contributions to Tape, Rx Preferences, Device Frame Generator and u2020.","avatarKey":"34e5fc2b-8fcb-477b-bc03-70b9ad0d3282","userCode":"d32d","company":"Segment","twitter":"f2prateek","linkedIn":null,"website":"f2prateek.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72019,"name":"Secrets of the Support Library","description":"The support library has become a necessity for the majority of Android developers. This talk will delve into some of its secrets, from bugs we've fixed, things we haven't (yet), and how some of the features you're using actually work back to API 9.","category":null,"startDate":"09/30/2016 11:40AM","endDate":"09/30/2016 12:20PM","publicEvent":true,"rsvpCount":15,"speakers":[{"id":31724,"name":"Chris Banes","profile":"Chris is an engineer working on the Android Support Libraries at Google, most notably AppCompat, Design lib and Palette. He has worked on Android things for over 6 years, from open source libraries to media apps, social networks and most stuff in between.","avatarKey":"User_e4c397a4-a459-40c3-b794-be839cf01de0","userCode":"9494e","company":"Google","twitter":"chrisbanes","linkedIn":null,"website":"https://chris.banes.me","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+ChrisBanes","nickname":null,"coverKey":"17ea5d03-e431-43c4-b05b-22c7a3652f5c_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72049,"name":"Testable Android Architecture","description":"So many testing tools exist for Android including JUnit, Mockito, Robolectric, and Espresso. But how can you design your application to leverage each one most effectively? This talk introduces a modified version of the Model View Presenter (MVP) architecture to organize your code to be more flexible, maintainable, and testable.","category":null,"startDate":"09/29/2016 04:00PM","endDate":"09/29/2016 04:40PM","publicEvent":true,"rsvpCount":9,"speakers":[{"id":5688,"name":"Chuck Greb","profile":"Mobile lead @ Mapzen. Open source aficionado, test-driven evangelist, and clean code connoisseur. Also Kotlin.","avatarKey":"162d435c-b6e1-409b-82e2-5dec7fe0b2ff","userCode":"58c6","company":"Mapzen","twitter":"ecgreb","linkedIn":null,"website":"mapzen.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72001,"name":"Deep Dive Into the Gradle-Based Android Build System","description":"This class will provide an in-depth tour of the new Android build system, which was designed to elegantly deal with the diversity of the Android ecosystem and the demands of modern development practices. We will go through its concepts and features such as variant support and the latest performance improvements.\r\n\r\nWe will give a sneak preview of a new major version of the Gradle Android plugin, which comes with another massive boost for performance, variant aware dependency management and an easier yet more powerful configuration model.\r\n\r\nHans Dockter will also show you the latest features of Gradle and how they are used in Gradle Inc’s mission to improve developer productivity and the overall developer experience. \r\n\r\n- The early adopter version of the Gradle Distributed cache that will become production ready later this year. \r\n\r\n- The latest milestone of using Kotlin for writing Gradle build scripts which now also works for Android builds and comes with amazing IDE support.\r\n\r\n- A demo the new Gradle Build Scan service which provides you with deep insights into build and developer productivity in your team and organization.\r\n\r\n- The new Gradle composite build feature which lets users enable arbitrary combinations of Gradle builds to work together. We will demo how you can use this feature to elegantly support typical workflows in a multi-repo environment including IDE integration.\r\n\r\n- The latest Gradle performance updates.","category":null,"startDate":"09/29/2016 10:40AM","endDate":"09/29/2016 11:20AM","publicEvent":true,"rsvpCount":15,"speakers":[{"id":70450,"name":"Hans Dockter","profile":"Hans Dockter is the founder and project lead of the Gradle build system and the CEO of Gradle Inc. a company that provides training, support and consulting for Gradle and all forms of enterprise software project automation in general. Hans is a thought leader in the field of project automation and has successfully been in charge of numerous large-scale enterprise builds. He is also an advocate of Domain Driven Design, having taught classes and delivered presentations on this topic together with Eric Evans. In the earlier days, Hans was also a committer for the JBoss project and founded the JBoss-IDE.","avatarKey":"User_104d0251-6580-4e7a-8797-526659126e00","userCode":"","company":"Gradle Inc","twitter":"hans_d","linkedIn":"","website":"https://gradle.org/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":71951,"name":"Right","description":"","mapImageUrl":"","events":[{"id":72000,"name":"Radical RecyclerView","description":"This talk will cover how to madly customize (almost) everything in a RecyclerView.  Today's apps aren't simple lists and grids. They have complex, hierarchical content and move, interact, and flow with the user and their device. The layout-dp folder is dead; long live the custom adapter! \r\n\r\n- Flow layouts dynamically from a single column on phone to grids and columns on tablets. Mix multiple sections and view types.\r\n- Let your lists move! Let users expand and collapse content and insert asynchronously from the network, all with predictive animations. Diff new content and dispatch fine-grained, animated updates in place.\r\n- Decorate views with backgrounds, separators, and indents (like sections with headers, groups with different \"backgrounds\", mixed rows and grids!) \r\n- Allow any part of your content to be rearranged or swipe-to-delete. \r\n\r\nWe'll talk about custom adapters, ItemDecorators, ItemTouchHelpers, ItemAnimators, SpanSizeLookups, and everything short of making your own LayoutManager.","category":null,"startDate":"09/29/2016 01:30PM","endDate":"09/29/2016 02:10PM","publicEvent":true,"rsvpCount":26,"speakers":[{"id":24406,"name":"Lisa Wray","profile":"Lisa is currently a one-woman Android team at Genius, the world's largest repository of musical knowledge.  Previously, she was a mobile developer at the New York Times and a developer advocate for Android and wearables at Google.  She has a B.S. in Computer Science and Music from M.I.T.","avatarKey":"http://static.sched.org/a6/2124575/avatar.jpg.320x320px.jpg?cbe","userCode":"cda3","company":"Genius","twitter":null,"linkedIn":null,"website":"genius.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72006,"name":"Keynote: Android is for Everyone","description":"There are currently over 1.4 billion active Android devices worldwide, and as Android expands globally, that number is guaranteed to increase. As developers, we need to start thinking now about how to create applications that serve a diverse range of users.  Specifically, we should think about the 1 billion people in the world with disabilities. We’ll talk about who these users are, common challenges they face with existing apps, and what it really means to create an inclusive user experience.  Let’s create applications that everyone can use!","category":null,"startDate":"09/29/2016 11:40AM","endDate":"09/29/2016 12:30PM","publicEvent":true,"rsvpCount":25,"speakers":[{"id":38305,"name":"Kelly Shuster","profile":"Kelly Shuster is an Android Developer at Ibotta and a Google Developer Expert for Android.  Prior to mobile development, she worked as an Embedded Firmware Engineer focused on disk drive read channel optimization.  She holds a Bachelor’s of Science in Electrical & Computer Engineering with minors in Computer Science and Political Science from the University of Colorado, Boulder.\r\n\r\nKelly is currently the director of Women Who Code Denver, and enjoys sharing technical knowledge wherever she goes, from local meetups to international conferences.  When not programing, she can be found dancing in a ballet studio or playing in the Rocky Mountains.","avatarKey":"a2a80663-c1de-4f0a-89f4-2168d74d7085","userCode":"2164e","company":"Ibotta","twitter":"KellyShuster","linkedIn":"https://www.linkedin.com/in/kellyshuster","website":"http://www.kiodev.com/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72034,"name":"Domain-Driven design by example for Android apps","description":"What is the business logic of the app? Where should it live? How can it be tested?\r\n\r\nThese are common questions that developers start asking themselves when their app and team start rapidly growing.\r\n\r\nTo address this problem at Lyft we applied principles of domain-driven design. It helped us to create common language to describe complex code and make it obvious and predictable.\r\n\r\nThis talk will focus on basics of domain-driven design, typical app layering structure and testability.","category":null,"startDate":"09/29/2016 02:20PM","endDate":"09/29/2016 03:00PM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":39156,"name":"Alexey Zakharov","profile":"Alexey Zakharov is the Lead Android Engineer at Lyft. He solely created first version of Lyft Android app during company's early days. Now he is focused on internal frameworks and practices to scale Android development within Lyft.","avatarKey":"abf65ab9-f488-4aa9-ba79-a75e93ca7a54","userCode":"1903b","company":"Lyft Inc.","twitter":"azakharov","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72045,"name":"Better Android Development with Kotlin and Gradle","description":"In this talk, Ty will walk you through setting up and using Kotlin with Gradle to streamline your workflow for Android development, both within the build tool phase and within the application itself, so that you can use a consistent language through the entire Android stack. After a brief overview of Kotlin, we’ll dive into how it can be used with Gradle to accelerate Android Development with a consistent language. I'll walk through a real world example of building a Gradle plugin in and scripts in Groovy, then I'll convert those into Kotlin. An open source repo of the sample will be provided to follow along.","category":null,"startDate":"09/30/2016 02:20PM","endDate":"09/30/2016 03:00PM","publicEvent":true,"rsvpCount":10,"speakers":[{"id":5666,"name":"Ty Smith","profile":"Ty has been working on Android since 2009. He is a tech lead at Uber, focusing on the external developer platform. He is a member of the Google Developer Expert program and regularly speaks at international conferences on Android. He organizes the SF Android Meetup group and Droidcon SF. He is a member of the technical advisory and investment group, Specialized Types. Prior to Uber, Ty worked on the Fabric tools at Twitter, the Evernote Android App and SDK, a messaging platform for Sprint, and Zagat for Android.","avatarKey":"3fe7fbc4-9810-431a-a00e-6ec1a9c2cc7f","userCode":"d66e","company":"Uber","twitter":"tsmith","linkedIn":null,"website":"tysmith.me","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"99ae0e84-8d6b-4848-8fe0-8b5ca705cf40_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72032,"name":"ADB, Break On Through To the Other Side","description":"ADB is maybe one of the most used tools by the Android developers. But it is for sure the less known.\r\n\r\nIf you ever wondered how ADB is working? Why is it faster now? How Android Studio is using it under the hood? Why my ADB server is killed sometimes? And by the way, what this server is about? This talk is made for you.\r\n\r\nI spent several weeks diving into the ADB source code for Genymotion and I learned interesting things about this project, its history, the internals, the interaction with the developers tools, ... It's time for me to share this with you!\r\n\r\nHere is an outline of the presentation:\r\n\r\n- How ADB works (the big picture)\r\n- Some ADB commands you maybe never heard about\r\n- The history of the project\r\n- The ADB Internals (the ADB protocols, the structure of the software)\r\n- How development tools are using ADB?\r\n","category":null,"startDate":"09/29/2016 10:40AM","endDate":"09/29/2016 11:20AM","publicEvent":true,"rsvpCount":8,"speakers":[{"id":65202,"name":"Eyal LEZMY","profile":"Eyal is a software engineer at Genymobile, working on Genymotion – an Android emulator. He's been working with Android since 2009.\r\n\r\nHe's also Treasurer at the Paris Android User Group and a Google Developer Expert in Android.\r\n\r\nOver the years, Eyal has been involved in several RandD projects with the French internet providers; worked for Samsung's Android B2B team; and built an Android STB for a hotel chain.","avatarKey":"User_21160394-7290-49e7-8fa1-1b8f6338448c","userCode":"bbe0c","company":"Genymobile","twitter":"Eyal_Lezmy","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+EyalLEZMY","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72040,"name":"Meetup in the Making","description":"The past 18 months for Meetup has been one of rediscovery and reimagining who and what we are. We have undergone a massive rebrand and with that, a complete redesign of the Android application. I have been the lead designer on the project, tasked to translate our new design language into something that sits within the Android ecosystem. My talk will focus on the challenges we faced as a design team such as, working on redesigning the app whilst a rebranding project was underway, and how we came to make the decisions we did and align them to the wider company but also to our native iOS counterpart. ","category":null,"startDate":"09/30/2016 09:10AM","endDate":"09/30/2016 09:50AM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":61308,"name":"Chris Austin","profile":"A Product Designer originally from Melbourne, Australia, now residing in New York City. Now lead Android design at Meetup overseeing the redesign of our new Android App.","avatarKey":"https://lh6.googleusercontent.com/-goWcd3fuyxI/AAAAAAAAAAI/AAAAAAAAQWw/nHOopfxNoWg/s96-c/photo.jpg","userCode":"91e30","company":"Meetup","twitter":null,"linkedIn":"https://www.linkedin.com/in/austinchris","website":"chrisaustin.work","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72003,"name":"ConstraintLayout, Inside and Out","description":"Android's updated layout editor tools promise to significantly change the way application developers build user interfaces. At the core of this new paradigm is the ConstraintLayout container. Constraint-based layouts are not new to Android developers, but the flexibility of this new container promises to flatten complex view hierarchies and reduce nesting. In this session, we will examine the layout engine ConstraintLayout uses in order to understand exactly how this new component works. You will see how the new layout tools define constraints, what kinds of constraints are supported, and how ConstraintLayout processes them to position views.","category":null,"startDate":"09/29/2016 03:10PM","endDate":"09/29/2016 03:50PM","publicEvent":true,"rsvpCount":19,"speakers":[{"id":65501,"name":"Dave Smith","profile":"Dave Smith (@devunwired) has been working with the Android platform at all levels since 2009, developing custom applications and system components to run Android on embedded platforms or interact with external embedded devices. He is a Google Developer Expert for Android and IoT and the author of the popular developer cookbook “Android Recipes: A Problem Solution Approach” from Apress. He regularly provides developer tips and sample code on GitHub (http://milehighandroid.com) and his personal blog (http://wiresareobsolete.com).","avatarKey":"https://lh3.googleusercontent.com/-O1xonkBJ9oE/AAAAAAAAAAI/AAAAAAAAAEc/qvCf164wPJw/s96-c/photo.jpg","userCode":"87505","company":"Wireless Designs, LLC","twitter":"devunwired","linkedIn":null,"website":"http://wiresareobsolete.com/","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+DaveSmithDev","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72104,"name":"Why should you care about coldstart and how?","description":"It's obvious that startup time is important for apps, but quantifying, measuring and analyzing startup time on a continuous basis isn't. \r\n\r\nIn this talk, we start up with a concrete definition of coldstart and describe techniques to measure it both as a part of continuous integration and from the field. We then look at how to visualize and analyze this data using standard Android performance tools and visualization tools we built. \r\n\r\nAnd to end it off, we talk about some strategies we've used to optimize the startup process.","category":null,"startDate":"09/29/2016 09:00AM","endDate":"09/29/2016 09:40AM","publicEvent":true,"rsvpCount":17,"speakers":[{"id":34166,"name":"Vikram Bodicherla","profile":"I am the tech lead for Yahoo Finance for Android. I've been developing Android apps for about 5 years now!","avatarKey":"2a157758-c941-4e57-aa9b-8b22dad32ee4","userCode":"77f95","company":"Yahoo","twitter":null,"linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"458693a6-f9d9-4b56-b0e0-22ffef8fab77_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72100,"name":"Interprocess communication on Android","description":"There are many forms of Interprocess Communication (IPC) on Android and the goal of this talk is to explore the reasons for each form and the best usages of them. This includes Intents, Broadcasts, Services, ContentProviders, Binders, and RemoteViews.\r\n\r\nWe'll talk about implementing private APIs between multiple apps from the same developer, or public APIs for third party apps to use. We'll also talk about interacting with the system, for things like appwidgets.\r\n\r\nWe'll also talk about some specific usages for IPC in Nova Launcher, including how launchers, and Nova in particular, handles AppWidgets and how Nova handles APIs between it's license key, TeslaUnread and third party apps.","category":null,"startDate":"09/30/2016 10:50AM","endDate":"09/30/2016 11:30AM","publicEvent":true,"rsvpCount":6,"speakers":[{"id":63250,"name":"Kevin Barry","profile":"Developer of Nova Launcher and WidgetLocker. I've been doing Android development for 6 years.","avatarKey":"https://lh3.googleusercontent.com/-0Z7Tt8srn_0/AAAAAAAAAAI/AAAAAAAAAg8/_t_KE0d51pU/s96-c/photo.jpg","userCode":"6fb61","company":"TeslaCoil Software","twitter":null,"linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+KevinBarry","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72110,"name":"Instagram Architecture at Scale","description":"The first version of Instagram for Android was built in four months by a team of two engineers. It’s been four years since that launch, and in that time we’ve added features such as video, direct messaging, photo maps, advertiser support. We’ve regularly released new filters, editing tools, and apps to unlock creative potential. Almost 30 engineers now work in our Android codebase every day. All this — yet Instagram for Android is still a fast-starting app and is only a 16MB APK download for most users. We will talk about how our app's architecture involved as the team grows, to achieve our performance and reliability goals. ","category":null,"startDate":"09/30/2016 03:10PM","endDate":"09/30/2016 03:50PM","publicEvent":true,"rsvpCount":9,"speakers":[{"id":66851,"name":"Kang Zhang","profile":"Kang is a Software Engineer from Instagram Core Client team. He works on Instagram Android app's performance and architecture. ","avatarKey":"User_25fcc048-f0dc-4b90-bd16-3277dd27e8f2","userCode":"24aa1","company":"Instagram","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72017,"name":"Decoding the Secrets of Binary Data","description":"Opaque blobs of data have hexed Android programmers for too long. It’s time to byte the bullet and learn how data is transmitted and persisted.\r\n\r\n<p>In this talk we’ll:\r\n\r\n<ul style=\"list-style: none;\">\r\n<li> 💾 Learn a bit about base64, little-endian, and EOF.\r\n<li> 💾 See how inefficient encodings nibble away resources.\r\n<li> 💾 Hash out the differences between ASCII, UTF-8, and other charsets.\r\n<li> 💾 Zip through examples of compression, crypto, and protocol buffers.\r\n<li> 💾 Load up on APIs and discover what Square’s Okio has in store.\r\n</ul>\r\n\r\n<p>This talk offers a short introduction to an array of topics. You’ll learn enough to be encode & decode whatever data you select!","category":null,"startDate":"09/30/2016 01:30PM","endDate":"09/30/2016 02:10PM","publicEvent":true,"rsvpCount":10,"speakers":[{"id":11505,"name":"Jesse Wilson","profile":"Jesse works on Square Cash in Waterloo Canada. He’s contributed to OkHttp, Retrofit, Dagger, and Guava.","avatarKey":"ac7d8eaa-2c25-4042-98b8-15caac9feb0d","userCode":"4be0","company":"Square, Inc.","twitter":"jessewilson","linkedIn":"","website":"https://publicobject.com/","email":null,"phone":"","phoneticName":null,"gPlus":"","nickname":null,"coverKey":null,"facebook":"","emailPublic":false,"following":false}]},{"id":72011,"name":"Efficient Android Layouts","description":"A well-written, efficient layout can increase performance and simplify maintenance.\r\n\r\nIn this talk we'll go over how to write the best layouts for your application. We'll cover a range of improvements including choosing the right ViewGroup, effectively leveraging resource qualifiers, avoiding code duplication, and more tips and tricks. Come and learn how to get the most power out of every View!","category":null,"startDate":"09/30/2016 10:00AM","endDate":"09/30/2016 10:40AM","publicEvent":true,"rsvpCount":17,"speakers":[{"id":25872,"name":"Dan Lew","profile":"Dan Lew has been an Android developer for seven years. He started at Mobiata (FlightTrack), went on to lead the Android team at Expedia, and is currently working at Trello. He's an Android Google Developer Expert and has been giving talks at local meetups and conferences for the last several years. He's released a couple minor open source Android libraries and several open source apps on Github. He also writes regularly about Android development at danlew.net.","avatarKey":"6f1eb73c-e3cd-4ff8-97d0-f277b8568e8e","userCode":"4c73","company":"Trello","twitter":"danlew42","linkedIn":null,"website":"http://danlew.net","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72037,"name":"JobScheduler is the Unavoidable Better Future.","description":"Persistent job scheduling implementations are going in nearly all our apps.\r\n\r\nOn Android, we have AlarmManager and JobScheduler APIs.\r\nWith Google Play Services, we also have GCM Network Manager and the upcoming Firebase JobDispatcher libraries.\r\n\r\nWe will briefly discuss AlarmManager and its limitations as well as JobScheduler and its niceties, for those new to the API.\r\nGCM Network Manager and its usecases will be the core of this talk, and then we will cover the current abstractions that Firebase JobDispatcher gives us.\r\n\r\nGCM Network Manager is going to be unavoidable in the near future of Android development.\r\nStatically registered implicit BroadcastReceivers are going to be no-oped in coming releases. (The NEW_PICTURE action already is no-oped in 7.0.)\r\n\r\nAt IFTTT, we rely on a lot of these broadcasts to run Triggers reliably, and we are now planning for the future with GCM Network Manager to continue delivering consistently great experiences for our users.\r\nThe removal of these implicit broadcasts is a great push to update to persistent job scheduling!","category":null,"startDate":"09/29/2016 05:40PM","endDate":"09/29/2016 06:20PM","publicEvent":true,"rsvpCount":10,"speakers":[{"id":8900,"name":"Eric Cochran","profile":"I strive to build delightful experiences for users' most personal devices. At IFTTT, I have the pleasure of working with a broad range of Android APIs and features across four apps. We love to connect and automate all the things, and Android has been no small part of that dream. I love constantly learning and building new techniques, and Android provides both a great platform and an excellent community for devs.","avatarKey":"914c8d56-2038-4c2f-bec2-365e77cea795","userCode":"caa9","company":"IFTTT","twitter":"Eric_Cochran","linkedIn":null,"website":"nightlynexus.com","email":null,"phone":null,"phoneticName":null,"gPlus":"+EricCochranNightlyNexus","nickname":null,"coverKey":"6e7544c9-3c79-4701-9174-435483e6bb30_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72039,"name":"Lightning fast Android builds with Gradle + Buck","description":"Gradle is the typical build system of choice for android development, but it's performance tends to degrade as code bases become more complex. There exist alternate build systems like Buck (built by Facebook) that can build significantly faster than Gradle for Android, but they can be hard to migrate to and maintain. What if it is possible to have both the simplicity of expressing build logic in Gradle and also the fast build speeds of Buck? In this talk, Gautam will go over the open source OkBuck Gradle plugin and how it can help improve your android build speeds without having to learn and maintain a new build system.","category":null,"startDate":"09/29/2016 04:50PM","endDate":"09/29/2016 05:30PM","publicEvent":true,"rsvpCount":8,"speakers":[{"id":64250,"name":"Gautam Korlam","profile":"I lead the Android Developer Experience Team at Uber. I am very passionate about tooling, infrastructure and build systems for building android apps at scale.","avatarKey":"https://lh6.googleusercontent.com/-lEtSGEshfdE/AAAAAAAAAAI/AAAAAAAAAfg/gead8R8Wr8g/s96-c/photo.jpg","userCode":"be5bb","company":"Uber","twitter":null,"linkedIn":"https://www.linkedin.com/in/gautamkorlam","website":"https://github.com/kageiit","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72101,"name":"Analyzing Scroll Performance","description":"You’ve noticed your app is slow when it is most noticeable: when scrolling. You’ve added remote logging and run the profiler - but now you have all the data and none of the answers. This talk will discuss strategies for digging through the mountain of data to determine techniques to improve scroll performance.","category":null,"startDate":"09/29/2016 04:00PM","endDate":"09/29/2016 04:40PM","publicEvent":true,"rsvpCount":11,"speakers":[{"id":36422,"name":"Eric Leong","profile":"I'm a senior Android engineer at Tumblr.","avatarKey":"8b74156b-63ff-425b-9897-a035d971fd9c","userCode":"b8a58","company":"Tumblr","twitter":"ericwleong","linkedIn":"https://www.linkedin.com/in/eric-leong-92347145","website":"http://ericleong.me","email":null,"phone":"","phoneticName":null,"gPlus":"https://plus.google.com/u/0/103746199749981693463","nickname":null,"coverKey":"f357cd44-68a2-4a6f-bdff-346a2421c5a5_cover","facebook":"","emailPublic":false,"following":false}]},{"id":72043,"name":"Practical GraphQL for Android","description":"Native mobile apps require a significant ongoing investment in building APIs. Most apps use REST style APIs that require matching client & server data models. Change is tedious and error-prone. Versioned endpoints must remain indefinitely. This leads to product stagnation and a resistance to evolving APIs to better suit product needs. GraphQL was designed specifically to address these issues. Facebook has used GraphQL since 2012 and it has proven to be a more productive paradigm than REST. \r\n\r\nGraphQL is an open specification that defines a declarative, compositional, strongly-typed language for data-fetching APIs. Facebook has released an open source reference implementation written in JavaScript. Community built open source libraries exist for Java, PHP, Python, Ruby, Go and more. \r\n\r\nThis talk will walk through usage of GraphQL in an Android app. It will also briefly cover wrapping an existing REST API to provide a GraphQL endpoint using graphql-js. No previous GraphQL experience is expected.","category":null,"startDate":"09/30/2016 11:40AM","endDate":"09/30/2016 12:20PM","publicEvent":true,"rsvpCount":6,"speakers":[{"id":5673,"name":"Kevin Schultz","profile":"Kevin Schultz is a software developer at Facebook. He was previously a Senior Software Engineer at Gilt Groupe, and worked on the team building Gilt&rsquo;s new native Android application. Prior to Gilt he was the Lead Mobile Engineer at Lua Technologies.<br /><br />Kevin began his career as a mechanical engineer designing nuclear submarines for General Dynamics Electric Boat. He carries the lessons learned about quality and lean manufacturing over to his software work with a focus on automated testing and continuous delivery.&nbsp;<br /><br />He has a BS in Mechanical Engineering with a minor in Computer Science from the University of Delaware.","avatarKey":"1300dbb8-4d70-4ad2-91c0-fea4445d77c9","userCode":"c705","company":"Facebook","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72047,"name":"Understanding Performance In The Wild","description":"This talk will discuss the way Facebook approaches the analysis of the production performance of the Facebook Android app. We will cover some of our existing tools, as well as our newest production tracing system. Facebook faces extreme challenges in performance measurement and diagnostics - from the fast-moving code base, through the wide spectrum of devices, to the variable conditions that the app is used in. Developing within these constraints has led to solutions involving byte code instrumentation, databases for performance markers, as well as heavy automation, analysis, and monitoring. This talk will cover in some detail the end-to-end flow as a product engineer as well as our overall vision.","category":null,"startDate":"09/29/2016 09:50AM","endDate":"09/29/2016 10:30AM","publicEvent":true,"rsvpCount":14,"speakers":[{"id":48701,"name":"Delyan Kratunov","profile":"I've worked on performance within the main Facebook for Android app for the past two years. Before that, I did more general Android work for multiple apps and games. Turns out, Android performance is hard everywhere, small or big! I also am (or at least was) a proud ADP1 user. We've come a long way!","avatarKey":"70984135-73c3-421f-a8fc-1b3825c8f84c","userCode":"0967f","company":"Facebook Inc.","twitter":"BurntBrunch","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"b40dbf49-e1ee-4aea-97db-0eb2eb6d881e_cover","facebook":"facebook.com/delyan.kratunov","emailPublic":false,"following":false}]}]},{"id":68650,"name":"Up","description":"","mapImageUrl":"","events":[{"id":72012,"name":"Measure, Layout, Draw, Repeat: Custom Views and ViewGroups","description":"Sometimes the Android platform layouts and widgets are all you need. Sometimes you need more control over design and interaction. Sometimes you need some help with performance. Custom Views and ViewGroups are powerful tools that can provide these things, but with great power comes great complexity.\r\n\r\nTo help you get started, we will first build a simple custom View and then add layout, drawing, and interaction. Along the way will discuss when and when not to go custom and talk good practices.","category":null,"startDate":"09/30/2016 10:50AM","endDate":"09/30/2016 11:30AM","publicEvent":true,"rsvpCount":10,"speakers":[{"id":5687,"name":"Huyen Tue Dao","profile":"Huyen Tue Dao is an Android developer and Google Developer Expert, a B.S. and M.S. in Computer Engineering from the University of Maryland, a member of the Android team at Trello, and co-creator of the “Android Dialogs” YouTube channel.\r\n\r\nThe only other thing that keeps her up as late as development (and often longer) is gaming: PC, console, board, card, anything.","avatarKey":"User_ea901592-e44a-4e55-95b1-d10701ac0b05","userCode":"84e4","company":"Trello","twitter":"queencodemonkey","linkedIn":"https://www.linkedin.com/in/huyentuedao","website":"randomlytyping.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72024,"name":"Know your user: Using Firebase Analytics for Audience Tracking & Targeting","description":"The rapid increase in the number and diversity of mobile devices, coupled with explosive growth in mobile applications, effectively creates huge demand for users' attention. While this has resulted in more app downloads, the truth is that many users who download an app often end up ignoring it -- or even worse, uninstalling it -- oftentimes after just a couple of uses. You may have infrequent users who suddenly become regulars, or vice versa.\r\n\r\nWhat causes users to uninstall your app after just 2 uses? What causes regulars to just \"stop\" suddenly? What defines an engaged user? And how does this definition change across users and across the life of your app? The answer to these questions is \"Analytics\" -- the ability to instrument your application to log events of interest, and then study patterns of events to detect user behaviors or application-usage insights of interest.\r\n\r\nIn this talk we will provide a general overview of the Analytics support for Android before doing a deep dive into \"Firebase Analytics\" (FA) as one available solution to this problem. The talk will cover setup and instrumentation of your application for using FA and explore various features with an interactive demo. \r\n\r\nIn particular, we will look at two capabilities: using  \"custom events\" to understand user behaviors (\"what\") and using \"user properties\" to then segment that user population (\"who\") into groups that makes it easier to target, track and evolve subsets who exhibit similar behaviors or interests.\r\n\r\n","category":null,"startDate":"09/29/2016 04:00PM","endDate":"09/29/2016 04:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":14854,"name":"Nitya Narasimhan","profile":"Nitya is a software professional with over 15+ years R&amp;D experience in industry, startups and academia. She spent over a decade at Motorola Labs working on advanced concepts for next-generation phone and television platforms, and currently balances consulting with early-stage technology development for mobile and web domains.<br /><br />She co-organizes the Google Developer Group chapters in New York City and Hudson Valley, and recently facilitated a successful 3-month Android Study Jam that taught a &lsquo;beginner&rsquo; cohort of students and professionals to develop a non-trivial Android application.","avatarKey":"http://static.sched.org/a6/1416559/avatar.jpg.320x320px.jpg?ce7","userCode":"04ac","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"9e2aa677-a0d5-4cbd-9579-edf69fef168d_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72041,"name":"Espresso: A Screenshot is Worth 1,000 Words","description":"Do your product owners, designers and the people that pay you understand what in the world your Espresso tests are doing and why they are valuable?  You've spent so much time and effort writing these tests and your whole team deserves to get the most benefit out of them.  In this talk you'll learn how to setup your Espresso tests to take programatic screenshots, and leverage the Robot pattern of testing for clean, readable, and maintainable tests. You'll also learn guidelines on when it's appropriate to write Espresso tests instead of Robolectric or Unit tests, and how to leverage mock data to make your Espresso tests run with Tesla-like speed.\r\n\r\nI have architected the Espresso test setup for our Capital One Wallet Android team and helped execute our ongoing continuous integration efforts. We've seen a 4x+ speed improvement over Appium, have more maintainable tests, and now have visibility for anyone to look into our test coverage.","category":null,"startDate":"09/30/2016 10:00AM","endDate":"09/30/2016 10:40AM","publicEvent":true,"rsvpCount":3,"speakers":[{"id":30914,"name":"Sam Edwards","profile":"Sam is a Lead Android Engineer for Capital One Wallet. He has been working with Android since 2011 and has over 12 years of professional experience with full-stack development with Java and JavaScript. Check out http://handstandsam.com where he shares tips and tricks about Android and software development.","avatarKey":"714cfefe-0135-4710-bbb1-7c4b545c32a6","userCode":"9a90e","company":"Capital One","twitter":"HandstandSam","linkedIn":"https://www.linkedin.com/in/handstandsam","website":"http://handstandsam.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"45a57821-d549-43ff-a8df-9f72e63de112_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72102,"name":"Expandable RecyclerViews and You","description":"Since it's launch at Google IO '14, RecyclerView has become the de-facto tool for displaying collection views. Unlike it's predecessor, ListView, RecyclerView is decoupled from the classic AbsListview and delegates all the different components required to show and animate a collection to a variety of other APIs - such as the RecyclerView.Adapter and LayoutManager. \r\n\r\nWhile RecyclerView definitely offers a brighter more customizable future - it is also still in it's infancy. Which means we don't get a lot of the basic use cases out of the  box like we had with ListView. \r\n\r\nIn this session we will walk through step by step how to replace one of the lost ListView subclasses - ExpandableListView. We will create our own custom RecyclerView.Adapter, and RecyclerView.ViewHolders to achieve a list that expands and collapses it's sections. And as a fun bonus at the end we'll even take a quick look at how we can add single and multi select functionality to the sections in our ExpandableRecyclerView.","category":null,"startDate":"09/29/2016 02:20PM","endDate":"09/29/2016 03:00PM","publicEvent":true,"rsvpCount":6,"speakers":[{"id":54857,"name":"Amanda Hill","profile":"Android Dev @ thougbot. Previously @ Venmo\r\n\r\nA not-so-recent grad from Cornell University, Amanda was born and raised in NYC. She loves street vendor hot dogs, white sneakers, and taking pictures of food. When she's not blogging about her culinary confections, she can be found cursing at Gradle or trying to convert everyone she meets to the wonderful world of functional reactive programming!","avatarKey":"72d6e59a-3381-49bc-91df-5f9cb2e00111","userCode":"773da","company":"thoughtbot","twitter":"mandybess","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72048,"name":"ListView -> RecyclerView","description":"The Facebook Android Feed Platform teams develops UI infrastructure to render the many \"infinite-scrolling\" feeds in the Facebook App, including News Feed. This talk will cover our experience migrating the underlying implementation of News Feed from Android's ListView to the newer RecyclerView (released in the Lollipop Support Library). Topics include: API differences between the two widgets, migration steps, performance improvements, and lessons learned along the way.","category":null,"startDate":"09/29/2016 10:40AM","endDate":"09/29/2016 11:20AM","publicEvent":true,"rsvpCount":6,"speakers":[{"id":62300,"name":"Benjamin Jaeger","profile":"Benjamin is an Android Developer at Facebook on the Feed Platform Team. He recently graduated from Cornell University with a B.S. and M.Eng. in Computer Science. His manager describes him as a key player and asset to the team with expert knowledge in scroll performance and building UI infrastructure. Although he currently lives in NYC, nobody considers him a True New Yorker due to his frustratingly slow walking speed and inability to swipe Metro Cards on the first try. He loves broccoli, kale, and green beans but hates spinach, brussel sprouts, and asparagus. Instead of wearing a watch to tell time, he prefers the old fashioned method of periodically fidgeting with his Android phone. He has yet to apprehend his first Pokémon.","avatarKey":"https://lh6.googleusercontent.com/-jXQek0HT_LU/AAAAAAAAAAI/AAAAAAAABWs/4vuLGY1DduI/s96-c/photo.jpg","userCode":"00ef3","company":"Facebook","twitter":null,"linkedIn":"https://www.linkedin.com/in/benjamin-jaeger-6964822b","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72106,"name":"Keeping it Clean","description":"Over the last year there has been a lot of buzz about Clean Architecture in the Android community, but what is Clean Architecture? How does it work? And should I be using it?\r\n\r\nRecently at Badoo we decided to rewrite our messenger component.  Over the years this core piece of functionality in our app has become large and unwieldy.  We wanted to take a fresh approach to try and prevent this from happening again.  We choose to use Clean Architecture to achieve our goal.  \r\n\r\nThis talk intends to share our journey from theory to implementation in an application with over 100 million downloads.  By the end, you should not only understand what Clean Architecture is, but how to implement it, and whether you should.","category":null,"startDate":"09/30/2016 03:10PM","endDate":"09/30/2016 03:50PM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":35167,"name":"Rich King","profile":"Senior Android developer with more than 7 years experience creating awesome Android apps. Based in London where I work for Badoo.","avatarKey":"65f28b50-f761-4d96-aad4-76993beb05e6","userCode":"94546","company":"Badoo","twitter":null,"linkedIn":null,"website":"https://github.com/kingamajick","email":null,"phone":null,"phoneticName":null,"gPlus":"kingamajick","nickname":null,"coverKey":null,"facebook":"kingamajick","emailPublic":false,"following":false}]},{"id":72103,"name":"VR for Everyone:  Daydream and Google Play Apps","description":"Google Play has become a critical platform for game developers to reach a wide and diverse audience. As VR is a nascent technology, both platform and developers have an opportunity to create a marketplace that offers a similarly broad and diverse catalog. In this talk, Serge Kassardjian shares how Google Play is adapting its store management approach to programming the launch portfolio of apps for Daydream – with the goal of moving VR from a novelty to a mainstream movement.","category":null,"startDate":"09/30/2016 02:20PM","endDate":"09/30/2016 03:00PM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":42852,"name":"Serge Kassardjian","profile":"Serge Kassardjian, Global Head of Android/Play Media Apps and Android TV Content Partnerships\r\nSerge Kassardjian Head of Android Play Apps and Games Business Development, North America East, GoogleSerge Kassardjian leads global business development efforts for Media companies for Android Play Apps including Entertainment, Video, Sports and News verticals.  Previously, he served as Head of North America East business development for Android Play Apps and Games including media, travel, e-commerce, payments, financial services and other verticals. He works with partners developing apps for Android across form factors including smartphones, tablets, TV, wearables and auto. He formerly worked on incubation businesses in Google’s GeoCommerce division, focused on Payments and Offers and was a member of the original Google Wallet launch team doing merchant partnerships. He also was a Venture Capital Investor at Globespan Capital Partners and Corporate Development Director in SonyMusic’s Global Digital Business. He started his career as an investment banker at Morgan Stanley. He received his MBA from Harvard and Bachelors and Masters in Engineering from Stanford where he was the President of his class.","avatarKey":null,"userCode":"ce519","company":"Google","twitter":null,"linkedIn":"https://www.linkedin.com/in/eric-leichtenschlag-29970930","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72111,"name":"Mobile SDKs: Use with Caution","description":"We’ve all heard of mobile SDKs. These off-the-shelf services that offer advertising, analytics, social and more. These SDKs are a great help in development process. They offer unique functionality, simplify the coding and save precious time and money. But SDKs are not really YOUR code. You work hard to ensure your users’ experience, safety and privacy in your own code, but can you be liable for these guests SDKs’ code as well? In this presentation, I’ll dive into the two major domains of risk introduced when using SDKs, and spice it up with real-life stories and what can be done to reduce the risk.","category":null,"startDate":"09/30/2016 11:40AM","endDate":"09/30/2016 12:20PM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":46550,"name":"Orly Shoavi","profile":"Orly Shoavi has held leading positions in R&D, Product Management, Product Marketing and Business Development.  Orly, who focused her entire career on the mobile industry, began as a software engineer at Intel and Radvision and as an Applications Team Leader at modu. She then shifted her focus to Product Management and Business Development at Telmap, which led her back to Intel after the company’s acquisition. There she was part of the management team of the New Devices Israel Group. In the past ten years Orly has dealt with dozens of SDKs integrations: from choosing the right SDKs for the various mobile applications she was involved in to the SDKs implementation and testing. Orly teaches at the Computer Science Faculty at IDC.\r\nOrly is an 8200-alumni and holds a BSc. and an MSc. in Computer Science, both from the Technion (Cum Laude) and an MBA from Tel Aviv University (Cum Laude).","avatarKey":"https://lh3.googleusercontent.com/-Znda6-MgIW8/AAAAAAAAAAI/AAAAAAAAAqQ/4UbDhZO_wZk/s96-c/photo.jpg","userCode":"cddae","company":"SafeDK","twitter":"orlyshoavi","linkedIn":"https://il.linkedin.com/in/orlyshoavi","website":"www.safedk.com","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+Safedk/posts","nickname":null,"coverKey":null,"facebook":"https://www.facebook.com/orly.meirshoavi","emailPublic":false,"following":false}]},{"id":72007,"name":"A Material Design guide for Android Developers","description":"Are you a developer who has heard of Material Design but are not sure where to get started? Have you wondered how apps like Google Play and Youtube do fancy animations, beautiful colors, and papercraft effectively? Fret not! This talk will bridge the gap between Google’s Material design documentation and the Android developer documentation and help you get started on building or revamping your app to follow Material Design guidelines.\r\n\r\nWe will look at code samples and learn how to make use of AppCompat and Design Support libraries so that you can implement UI elements that are commonly used across Android apps all the way back to Android Eclair (2.1, API Level 7). Along the way, we will also learn more about useful resources that will help you envision and build apps that look and feel “material”. ","category":null,"startDate":"09/29/2016 09:50AM","endDate":"09/29/2016 10:30AM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":12014,"name":"Yash Prabhu","profile":"Yash Prabhu leads the Android team at DramaFever (a Warner Bros. company) and has been developing Android apps since 2010. She has spoken at several Android meetups and conferences over the past three years. In her spare time, she volunteers at Girl Develop It Philadelphia, Code For Philadelphia and Google Developers Group Philadelphia as a teaching assistant, instructor, mentor and organizer.","avatarKey":"User_3e63d82d-ea7d-4716-8d23-d989ee34b5f2","userCode":"a21d","company":"DramaFever","twitter":"yashvprabhu","linkedIn":null,"website":"yprabhu.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72014,"name":"Kotlin in Production","description":"\r\nIt is hard to argue that Kotlin is not an amazing language. What is easy to argue is that there are many unknowns about its performance in the wild and at scale, which makes it hard to make an informed decision about incorporating it into your app. Fortunately for you, we went there and have lived to tell the tale. After more than a year of maintaining a pure Kotlin app at Highlight, and more recently helping Pinterest ramp up Kotlin in Android, we've learned much about the ramifications of moving away from Java. Come learn from our mistakes and successes as we cover the highs, and lows, of using Kotlin in the wild!","category":null,"startDate":"09/30/2016 01:30PM","endDate":"09/30/2016 02:10PM","publicEvent":true,"rsvpCount":7,"speakers":[{"id":49250,"name":"Christina Lee","profile":"Christina is currently working on making video a reality at Pinterest. In addition to trying to convince the world to use Kotlin on a daily basis, she also enjoys building beautiful UI’s, extolling the virtues of Rx, and reading well documented APIs.","avatarKey":"4caf38a2-01d3-4c23-bb1c-01065e9c78dc","userCode":"a6c0c","company":"Pinterest","twitter":"RunChristinaRun","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"797f40d2-04b6-451e-9f16-64d3bb7d171e_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":72033,"name":"Effective Authentication User Experience for Consumer Apps","description":"How often do users hit the \"Forgot password?\" button in your app or abandon account creation? In research at Google and across the industry, we've found that typically over half of people seeing a sign-in page will fail to authenticate, ranging from making typos to creating duplicate accounts. Building a secure and usable auth experience is tricky.\r\n\r\nWe'll present some suggestions and examples of ideas that you can apply in your app to reduce errors, streamline account creation, and even enable automatic sign-in. These concepts are illustrated with an open-source sample that Google built for Firebase Auth.","category":null,"startDate":"09/29/2016 01:30PM","endDate":"09/29/2016 02:10PM","publicEvent":true,"rsvpCount":4,"speakers":[{"id":66053,"name":"Steven Soneff","profile":"Steven is product manager for Google's developer APIs for authentication on Android, including Google Sign-In and Smart Lock for Passwords. He previously worked as an engineer on Android apps at Google, did Android development at several several start-up companies, and wrote the original Facebook Android SDK launched in 2010.","avatarKey":"https://lh5.googleusercontent.com/-NSctVoHbkHY/AAAAAAAAAAI/AAAAAAAAAkQ/hvwbRoL4O5I/s96-c/photo.jpg","userCode":"3b858","company":"Google","twitter":null,"linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":75100,"name":"Welcome","description":"We'll discuss welcome things! Maybe rant about audio jacks.","category":null,"startDate":"09/29/2016 11:30AM","endDate":"09/29/2016 11:40AM","publicEvent":true,"rsvpCount":22,"speakers":[{"id":5950,"name":"Kevin Galligan","profile":"President of touchlab and general Droidcon NYC content person.","avatarKey":"User_6068d0a0-5cca-46c6-953b-3f3d72f4e51f","userCode":"0ecd","company":"touchlab","twitter":"kpgalligan","linkedIn":"","website":"http://about.me/kpgalligan","email":"kgalligan@gmail.com","phone":"","phoneticName":null,"gPlus":"","nickname":null,"coverKey":"f062a597-3522-481b-b1d8-4826ee4c934a_cover","facebook":"","emailPublic":true,"following":false}]},{"id":72035,"name":"How to achieve the best experience for Multi-Window:","description":"If you aren’t handling config changes in your app and you plan on targeting Android N, you may be in for a rude awakening. Unlike most features released Multi-Window happens to be opt out only. What this means for you and your users is a whole new way to experience your app. Let’s talk about how to manage upgrading your app and how multi-window affects your design and some possible strategies to make this the best experience for your users.","category":null,"startDate":"09/29/2016 03:10PM","endDate":"09/29/2016 03:50PM","publicEvent":true,"rsvpCount":4,"speakers":[{"id":25865,"name":"Elliott Chenger","profile":"Elliott Chenger is a Senior Engineer on the Connected Products team at Under Armour Connected Fitness. Since 2010 he has collaborated on Android apps ranging from digital streaming and personal insurance to personal fitness. He has also developed applications for both Android Wear and Google Glass. Passionate about his field, Elliott blogs every so often on his website, omitneedlesscode.com, and loves talking about all things Android.","avatarKey":"http://static.sched.org/a6/2148290/avatar.jpg.320x320px.jpg?385","userCode":"e4f2","company":"Under Armour","twitter":"echenger","linkedIn":null,"website":"omitneedlesscode.com","email":null,"phone":null,"phoneticName":"","gPlus":null,"nickname":"","coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":72046,"name":"Designing for the Next Billion","description":"A lot of focus has been spent by organizations like Google to encourage developers to target audiences around the world who're coming online for the first time. Most of these users tend to come online using a smartphone and are from developing countries like India, Indonesia, Africa, etc. However, while best practices are being shared on the technical front, there's a significant lack of understanding of what design patterns work and what doesn't for these audiences.\r\n\r\nThe talk is the result of research that I'm conducting in various parts of India, talking with people who speak a wide variety of languages, come from different socio-economic backgrounds and, ultimately, use their smartphones for different things.","category":null,"startDate":"09/30/2016 09:10AM","endDate":"09/30/2016 09:50AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":40100,"name":"Raveesh Bhalla","profile":"I'm a Google Expert for UX/Design and an independent consultant. I work with several startups in India, helping them provide delightful experiences to their users, and specialize in Android design.","avatarKey":"https://lh4.googleusercontent.com/-0R4u1RJklEE/AAAAAAAAAAI/AAAAAAAAfZk/beqA2TO9V9s/s96-c/photo.jpg","userCode":"792e5","company":"Independent Consultant","twitter":"raveeshbhalla","linkedIn":"linkedin.com/in/raveeshbhalla","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+RaveeshBhalla","nickname":null,"coverKey":null,"facebook":"https://www.facebook.com/raveeshbhalla","emailPublic":false,"following":false}]},{"id":75301,"name":"Fireside Chat","description":"","category":null,"startDate":"09/30/2016 04:50PM","endDate":"09/30/2016 05:10PM","publicEvent":true,"rsvpCount":13,"speakers":[]}]}],"blocks":[{"id":75400,"name":"Registration/Breakfast","description":"","startDate":"09/29/2016 08:00AM","endDate":"09/29/2016 09:00AM"},{"id":75401,"name":"Lunch","description":"","startDate":"09/29/2016 12:30PM","endDate":"09/29/2016 01:30PM"},{"id":75402,"name":"Party!","description":"","startDate":"09/29/2016 07:00PM","endDate":"09/29/2016 10:00PM"},{"id":75403,"name":"Breakfast","description":"","startDate":"09/30/2016 08:00AM","endDate":"09/30/2016 09:00AM"},{"id":75404,"name":"Lunch","description":"","startDate":"09/30/2016 12:30PM","endDate":"09/30/2016 01:30PM"}]}