{"id":90400,"name":"Droidcon NYC 2017","description":"    <p>\r\n        Popular topics this year will likely be around:\r\n    </p>\r\n\r\n    <ul>\r\n        <li>Kotlin</li>\r\n        <li>Architectural best practice</li>\r\n        <li>Rx</li>\r\n        <li>IOT</li>\r\n    </ul>\r\n\r\n    <p>As usual, deep dives and expert level talks generally get more interest.</p>\r\n\r\n    <p><i>If you have topic ideas you'd like others to tackle, tweet at <a href=\"http://twitter.com/droidconnyc\">@droidconnyc</a> and we'll post them.</i></p>","locationName":"","startDate":"09/25/2017 08:00AM","endDate":"09/26/2017 05:00PM","venues":[{"id":96300,"name":"Code Lab (Hub 2)","description":"","mapImageUrl":"","events":[{"id":103253,"name":"Android Things","description":"","category":null,"startDate":"09/26/2017 11:30AM","endDate":"09/26/2017 03:00PM","publicEvent":true,"rsvpCount":0,"speakers":[]},{"id":103254,"name":"Android Things","description":"","category":null,"startDate":"09/26/2017 03:00PM","endDate":"09/26/2017 06:00PM","publicEvent":true,"rsvpCount":0,"speakers":[]},{"id":103252,"name":"Prototyping fun with Android Things","description":"Android Things is coming. Two Bulls has been playing in the developer preview to see how we can lever our Android knowledge into IoT. Come learn with us by hacking on some of our prototypes. Let's move wires around and talk about sensors. Lots of fun, lots of laughs.","category":null,"startDate":"09/26/2017 10:40AM","endDate":"09/26/2017 11:20AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":104405,"name":"Tyler Williams","profile":"","avatarKey":"User_353462d4-24e8-4c81-91d7-3961986e8ebb","userCode":"","company":"Two Bulls","twitter":"","linkedIn":"","website":"https://www.twobulls.com/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103260,"name":"Workshop: Learning Litho","description":"Litho is a new and open sourced UI rendering framework from Facebook! It's declarative, enables background thread layout, and is heavily optimized for scrollable surfaces. Take a step-by-step tour of the library and follow along as we build simple to moderately complex UI elements.\r\n\r\nTo prepare and effectively follow along with the presentation, you'll need to do a little work before attending:\r\n1) Clone the litho repo (https://github.com/facebook/litho).\r\n2) Make sure building and installing the app in the `sample-codelab` folder works. You can use buck or gradle.","category":null,"startDate":"09/26/2017 09:50AM","endDate":"09/26/2017 10:30AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":25866,"name":"Jason Sendros","profile":"I've been working on the Facebook for Android app for the past 5 years. In that time, I've worked on scroll performance for News Feed and rewritten the rendering infrastructure for News Feed twice. I'm a Litho wizard, a scroll performance guru, and I am sometimes lucky enough to stumble my way through Flexbox.","avatarKey":"http://static.sched.org/a6/2148012/avatar.jpg.320x320px.jpg?68b","userCode":"07f2","company":"Facebook","twitter":null,"linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":102001,"name":"Pasquale Anatriello","profile":"Pasquale is part of the Native UI Frameworks team at Facebook. He has been working on Android since 2009 and is now a core contributor of Litho","avatarKey":"User_b5b031e5-18c3-4643-8d79-fc3f9793e0d5","userCode":"","company":"Facebook","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103250,"name":"Easily Integrate barcode scanning in your Enterprise Android Application","description":"In this session, we will walk through the code needed to integrate Barcode Scanning into your application using DataWedge on Zebra Android Devices.","category":null,"startDate":"09/26/2017 09:00AM","endDate":"09/26/2017 09:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":104402,"name":"Bill Hecox","profile":"Bill Hecox is an Android Developer Evangelist and technical communications specialist with Zebra Technologies. Along with providing development support to customers and partners via Zebra’s Developer Community, he also develops Android system utilities and tools featured on Zebra’s Android Devices.","avatarKey":"User_25ff3fa9-7278-4f2f-b4f0-caf646fc83ab","userCode":"","company":"Zebra Technologies","twitter":"billhecox","linkedIn":"","website":"https://www.zebra.com/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":104403,"name":"Robin Chander","profile":"Part of the software sustaining team at Zebra Technologies, Robin Chander has deep platform level knowledge in the Linux & Android based products with versatile development experience across kernel, framework and applications.","avatarKey":"User_421f6831-bdda-4754-8c4d-7b6ba768e614","userCode":"","company":"Zebra Technologies","twitter":"","linkedIn":"","website":"https://www.zebra.com/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":102851,"name":"Forum A","description":"","mapImageUrl":"","events":[{"id":103018,"name":"Advanced HTTP Mocking with WireMock","description":"Create HTTP mocks for your Android app with WireMock for deterministic testing and development.  Don’t have mocks yet?  No worries.  You can record live traffic with WireMock that can be saved and played back.  Testing apps that rely on APIs can be painful, flaky and complicated because more than likely, the APIs you rely on are out of your control. It’s time to take control back. WireMock can run as an embedded HTTP server on an Android device, but also can be run on your desktop to help with common development and testing tasks.\r\n\r\nDuring this talk, you'll learn how to record and playback network traffic, programmatically setup mocks, simulate error scenarios & latency, verify HTTP calls with mockito-like syntax, and simulate stateful behavior using \"scenario\" mappings (same endpoint, different responses).  You'll also learn best practices and lessons learned from our use of WireMock with the Capital One Wallet app. Our testing and development teams have used it for the last 2 years, and I like to call it the \"Swiss Army Knife\" of HTTP.  It has played a key part of creating reliable instrumentation tests and a \"mock\" (offline) flavor of our app.","category":null,"startDate":"09/25/2017 04:10PM","endDate":"09/25/2017 04:50PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":30914,"name":"Sam Edwards","profile":"Sam is a Lead Android Engineer for Capital One Wallet. He has been working with Android since 2011 and has passion for clean, testable code, and developer productivity. Check out http://handstandsam.com where he shares tips and tricks about Android and software development.","avatarKey":"714cfefe-0135-4710-bbb1-7c4b545c32a6","userCode":"9a90e","company":"Capital One","twitter":"HandstandSam","linkedIn":"https://www.linkedin.com/in/handstandsam","website":"http://handstandsam.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"45a57821-d549-43ff-a8df-9f72e63de112_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":103015,"name":"Seeing is Believing: Mobile Vision API Deep Dive","description":"Did you know that your mobile device can recognize objects in photos and videos? It can detect faces, barcodes and text in an image and even detect whether those faces are smiling or winking! \r\n \r\nAll this is possible because of the Mobile Vision API which finds objects in photos and videos on mobile devices, using real-time on-device vision technology. This API will enable you edit photos and videos, automate text data entry, embed barcode scanners into your applications and even build your own version of a Stories application with lots of filters.\r\n \r\nIn this talk, you’ll learn how to use the Mobile Vision API to get more out of your photos and videos. You’ll get a jumpstart on implementing Machine Learning in your apps with the power of this API!","category":null,"startDate":"09/25/2017 01:30PM","endDate":"09/25/2017 02:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":92302,"name":"Moyinoluwa Adeyemi","profile":"Moyinoluwa is an Android Developer who enjoys exploring the latest technologies in Android Development. She loves sharing her knowledge by writing on Medium. She also cares a lot about building apps that look good and work well on all devices. She manages Yoruba Watch Faces, an Android application and a collection of watch faces that tell the time in Yoruba a Nigerian dialect.","avatarKey":"https://lh5.googleusercontent.com/-TWi-LhQKNCA/AAAAAAAAAAI/AAAAAAAASxc/vv6YXao_IpU/s96-c/photo.jpg","userCode":"3ecde","company":"Off Grid Electric","twitter":"moyheen","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103016,"name":"Building Camera Features in a Snap","description":"Android 5.0 introduced the Camera2 APIs which include a full spectrum of camera features and configurations. However, building features with this powerful API can be overwhelming.<br /><br />\r\n\r\nIn this talk, we’ll:<br /><br />\r\n\r\n• Learn how camera hardware works and how that’s exposed in software<br />\r\n• Digest the bits and bytes of color spaces and image formats<br />\r\n• Visualize how image kernels work<br />\r\n• Set up a testing environment that allows us to iterate quickly<br />\r\n• Introduce the concepts of computer vision<br /><br />\r\n\r\nThis talk will get you up and running with the camera APIs. You’ll learn how to write efficient code that operates on millions of pixels.","category":null,"startDate":"09/25/2017 02:20PM","endDate":"09/25/2017 03:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":14015,"name":"Matt Precious","profile":"Lead developer of Square Cash for Android in Waterloo, Canada. Contributor to several open source projects including Telescope, Whorlwind, Swirl, and u2020.","avatarKey":"http://static.sched.org/a6/1414165/avatar.jpg.320x320px.jpg?62e","userCode":"ebac","company":"Square, Inc.","twitter":"mattprec","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"e1f58534-01df-4e33-b05f-3d1e1a9c61a0_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":103017,"name":"Deep Android Integrations","description":"Designing an elegant interface for developers to communicate with your Android app is crucial for building a mobile platform. Ty has been building mobile-focused developer platforms at Evernote, Twitter, and now Uber. In this talk, he’ll walk you through many of the best practices that he has accumulated and you’ll find out how to allow third party developers to seamlessly interact with your users’ local data to shortcut more expensive server operations.\r\n\r\nTopics will include building single sign-on, surfacing your local databases, constructing well-defined Intent interfaces, using deep links, and binding services for programmatic communication. Ty will walk you through how to create a well-defined interface in your app – if that’s something you want to know, don’t miss it!","category":null,"startDate":"09/25/2017 03:10PM","endDate":"09/25/2017 03:50PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":50356,"name":"Ty Smith","profile":"Ty has been working on Android since 2009. He is a tech lead at Uber, focusing on the external developer platform. He is a member of the Google Developer Expert program and regularly speaks at international conferences on Android. He organizes the SF Android Meetup group and Droidcon SF. He is a member of the technical advisory and investment group, Specialized Types. Prior to Uber, Ty worked on the Fabric tools at Twitter, the Evernote Android App and SDK, a messaging platform for Sprint, and Zagat for Android.","avatarKey":"https://lh5.googleusercontent.com/-HmM6FQM2Fak/AAAAAAAAAAI/AAAAAAAAABE/7yeHx-TgXSM/s96-c/photo.jpg","userCode":"c1455","company":"Uber","twitter":"tsmith","linkedIn":null,"website":"tysmith.me","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103020,"name":"Lottie and the Language of Motion Design","description":"Lottie is an After Effects renderer for Android, iOS and React Native. Join me as I walk through how it came to existence at Airbnb and how we're as well as many other companies are using it today. The core part of the talk will involve showing an animation rendered with Lottie then breaking it down piece by piece to show different tools motion designers use in After Effects and how they're implemented under the hood in Lottie for Android.","category":null,"startDate":"09/25/2017 05:50PM","endDate":"09/25/2017 06:30PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":69800,"name":"Gabriel Peal","profile":"Gabriel is a software engineer at Airbnb. He built Lottie for Android and works on React Native and Android infrastructure. Prior to Airbnb, he was an early member of the Android Auto team at Google.","avatarKey":"https://lh5.googleusercontent.com/-D9dLdoNHd4g/AAAAAAAAAAI/AAAAAAAAZNk/6kK0oVyNGOc/s96-c/photo.jpg","userCode":"a3cc5","company":"Airbnb","twitter":"gpeal8","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103013,"name":"ViewModels, LiveData and Lifecycles, oh my!","description":"It's 2017 and there's a solution for configuration change challenges: enter the ViewModel, a class introduced with the new Android Architecture Components library. ViewModels manage UI-related data in a life-cycle conscious way that survives configuration changes. But ViewModels do much more. Through practical examples, we'll use ViewModel as a point of entry into a discussion about Reactive UIs and the new Android Architecture Lifecycle Components. By the end of this session, you'll know the ins and outs of ViewModels, how they relate to other framework and Architecture Component classes and how to incorporate them into your app.","category":null,"startDate":"09/26/2017 01:50PM","endDate":"09/26/2017 02:30PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":94353,"name":"Lyla Fujiwara","profile":"Lyla Fujiwara is an Android Developer Advocate at Google. Prior to joining Google, she worked at Udacity on the Android team, where she taught introductory to advanced Android and Firebase content to over a hundred thousand developers. She's a returned Peace Corps volunteer and has taught and lived on three continents.","avatarKey":"https://lh6.googleusercontent.com/-4lcP7rWbow8/AAAAAAAAAAI/AAAAAAAAAKs/-V6YkvcUTGU/s96-c/photo.jpg","userCode":"355e4","company":"Google","twitter":null,"linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103023,"name":"Exploring Tensor Flow on Android","description":"Machine Learning is rapidly gaining traction from image classifiers to image filters to face recognition and beyond. Machine Learning and Mobile puts you at the forefront for the next frontier. \r\n\r\nThis talk will be designed for experienced Android Developers and will dive into using Tensor Flow on Android and provide some easy to understand use cases for those who have never done machine learning before. ","category":null,"startDate":"09/26/2017 11:00AM","endDate":"09/26/2017 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":80120,"name":"Zach Westlake","profile":"Zach Westlake is an Android Developer at Pinterest. Zach has spent 4 years working in the mobile development space and 6 years as a software engineer. His past includes working at The Hunt and the United States Air Force. When he isn't geeking out on Android he is either messing with his camera, backpacking or collecting pictures of pugs for his Pinterest board.  Zach has a B.S. in Computer Science. He lives in Oakland.","avatarKey":null,"userCode":"ee102","company":"Pinterest","twitter":"zachwestlake","linkedIn":"https://www.linkedin.com/in/zachwestlake","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103027,"name":"Effective Data Prefetching on Background ","description":"The ability of prefetching data while app is on background can decouple the usability of your application from network availability. Moreover, it can minimize cellular data usage and significantly increase perceived speed. \r\n\r\nThis talk walks through the main technical/performance challenges of the implementation by using Instagram as an example. How to schedule data prefetching on background? What framework is the most appropriate to execute this type of work? What things should you be prefetching?","category":null,"startDate":"09/26/2017 02:40PM","endDate":"09/26/2017 03:20PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":94751,"name":"Lola Priego","profile":"Software Engineer at Facebook/Instagram. Focusing on improving and keeping Instagram's performance on Android. Prior to Facebook/Instagram, I was on Amazon Kindle. Fun fact: I am teaching kids how to code in Liberia, Africa.","avatarKey":"User_b4eb737c-8dac-4257-9b90-c3ed8284ae84","userCode":"5cf56","company":"Facebook/Instagram","twitter":null,"linkedIn":"https://www.linkedin.com/in/lolalpriego/","website":"lolapriego.me","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":"https://www.facebook.com/lolita.priego","emailPublic":false,"following":false}]},{"id":103048,"name":"Doo z z z z z e","description":"With Android Marshmallow Google introduced two new power-saving modes: Doze and App Standby. True to their intent, both provide longer battery life and better performance. Their effectiveness further improved in Android Nougat. However, these modes carry some limitations developers should be aware of. To further improve power-saving Android O will be even more restrictive and disable common implicit broadcasts. Many apps rely on implicit broadcasts so if you're using those, supporting older and newer devices at the same time is going to be more challenging.\r\n\r\nThis talk will explain why these new APIs are better. We will discuss the given tools and dive into the new APIs. Finally, we will explore effective solutions to avoid duplicating code over and over again for different SDK versions.\r\n","category":null,"startDate":"09/25/2017 10:00AM","endDate":"09/25/2017 10:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":90650,"name":"Ralf Wondratschek","profile":"Ralf Wondratschek is a Sr. Software Engineer, Android on the Evernote product team. Ralf works on the core Evernote client with a special focus on software architecture, the camera and third party app integration. He also maintains several open-source projects on Github like the Evernote Android SDK and the job library for Android.\r\n\r\nPrior to Evernote, Ralf worked together with several companies in Germany and published as independent developer three apps in the Google Play Store.","avatarKey":"https://lh6.googleusercontent.com/-lKQQ8WBZJdI/AAAAAAAAAAI/AAAAAAAAKL4/zTWzwnsXubc/s96-c/photo.jpg","userCode":"4cad2","company":"Evernote","twitter":"vRallev","linkedIn":"https://www.linkedin.com/in/ralf-wondratschek-a0113064/","website":"http://vrallev.net/ralf","email":null,"phone":null,"phoneticName":null,"gPlus":"+vRallev","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103100,"name":"View performance deep dive","description":"We will dive deep into how Android measures, lays out, and draws views on screen. Using this knowledge we will take a sample application which sometimes skips a frame and optimize it to the point of perfect 60 fps. We will cover basic high level optimizations as well as experimental low level optimizations. These optimizations are part of the core which makes Litho fast.","category":null,"startDate":"09/25/2017 11:40AM","endDate":"09/25/2017 12:20PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":91152,"name":"Emil Sjölander","profile":"Works on the Native UI Frameworks team at Facebook. Emil is the core maintainer of Yoga and has been active in the development of Litho.","avatarKey":"User_ecae4a7d-1aac-4299-ae42-6f9c7ba9c819","userCode":"001a6","company":"Facebook","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":102001,"name":"Pasquale Anatriello","profile":"Pasquale is part of the Native UI Frameworks team at Facebook. He has been working on Android since 2009 and is now a core contributor of Litho","avatarKey":"User_b5b031e5-18c3-4643-8d79-fc3f9793e0d5","userCode":"","company":"Facebook","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103024,"name":"Applied TensorFlow in Android apps","description":"Find out how to use machine learning on Android!\r\n \r\nThis talk is a hands-on guide to using TensorFlow in your Android app.  We will cover:\r\n-A brief overview of machine learning.\r\n-How to use machine learning in Android apps:\r\n --Machine learning REST APIs.\r\n --Using a pre-trained TensorFlow model.\r\n --Inspecting TensorFlow models in TensorBoard.\r\n --Training and transfer learning with TensorFlow.\r\n","category":null,"startDate":"09/26/2017 11:50AM","endDate":"09/26/2017 12:30PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":30944,"name":"Dan Jarvis","profile":"Dan leads development of the Capital One Wallet app for Android and blogs about machine learning: http://medium.com/@daj\r\n\r\nDan is a long time Stackoverflow user who is passionate about automated testing, continuous integration and agile development.  He likes clean, maintainable code and lots of logging and monitoring to make sure everything works as it should.\r\n\r\nBlog: http://medium.com/@daj\r\nProfile: https://stackoverflow.com/cv/dj\r\nTwitter: @jarvisapps","avatarKey":"User_e1b75d89-788a-4679-8432-b37d517cc9f4","userCode":"b5e8e","company":"Capital One","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103028,"name":"The Rx Workflow Pattern","description":"Square's flagship Point of Sale app has been in continuous development for more than seven years. In that time neither the software nor the teams that build it have gotten any smaller. We've learned a lot about what does and doesn't scale, and this year have distilled those lessons into a new composition style we're calling Workflows. I'll discuss in depth how we're refactoring the hairiest parts of our Android and iOS apps into Rx-based workflows built of workflows built of workflows.","category":null,"startDate":"09/26/2017 03:40PM","endDate":"09/26/2017 04:20PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":12007,"name":"Ray Ryan","profile":"Ray Ryan is a senior software citizen at Square, where he focuses on making Android development tolerable. He has been goading people into writing software the way he thinks they should since the 1980s.","avatarKey":"User_9065d4e4-bbab-4a36-bbf6-9ff632e54d12","userCode":"9079","company":"Square","twitter":"rjrjr","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103021,"name":"Optimizing Dagger on Android: Developer Workflow and Runtime Performance","description":"We'll discuss recent developments in Dagger for Android, both in terms of new APIs in dagger.android and optimizations in generated code. We'll then discuss how to not encounter common pitfalls that increase compilation and runtime performance. Lastly we will go over ways to structure repositories to make them build, run and test quickly.","category":null,"startDate":"09/26/2017 09:00AM","endDate":"09/26/2017 09:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":5682,"name":"Ron Shapiro","profile":"Ron spends most of his work time improving Dagger at Google. He works on the Java Core Libraries Team which also produces Guava, AutoValue, AutoFactory, Compile Testing, and other common libraries for Android. He also runs half marathons, thinking through code to keep him occupied during the race. He graduated from the Joint Program between Columbia University and the Jewish Theological Seminary in 2013.","avatarKey":"http://static.sched.org/a4/1375256/avatar.jpg","userCode":"6ec5","company":"Google","twitter":null,"linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103049,"name":"Multi-threaded Rendering on Android (with Litho & Infer)","description":"The Facebook UI Foundation team develops UI rendering infrastructure for common surfaces in the Facebook app. We recently migrated the Facebook Android News Feed codebase to background rendering in a scalable, safe, and performant manor. This talk will introduce how our teams completed this migration utilizing two open source libraries — Litho and Infer — while improving scroll performance and developing an analyzer which automatically finds concurrency bugs (and other bugs too!). We'll share some of the issues we ran into, performance results, and how you too can use these libraries in your own app.","category":null,"startDate":"09/26/2017 01:00PM","endDate":"09/26/2017 01:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":94558,"name":"Jingbo Yang","profile":"I graduated from Columbia University with a Masters degree in Computer Science and am currently an Android Developer at Facebook. After one year of product development on Timeline, I switched to work on scroll performance and multi-threaded rendering in News Feed. Three years in and I am deeply addicted to it! When rendering starts to get slow, I fight to make it fast!","avatarKey":"User_be0b3048-59ca-40cc-9336-9cf73346e5bd","userCode":"c873f","company":"Facebook","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":102000,"name":"Benjamin Jaeger","profile":"Benjamin is an Android Engineer on the Facebook Maps Infra team in Boston and previously worked on the UI Foundation Team in NYC. He recently graduated from Cornell University with a B.S. and M.Eng. in Computer Science. In his free time, he shepherds a flock of Androids around the Boston Common.","avatarKey":"User_56cd826d-536c-4022-bd0e-dbd095c7f615","userCode":"","company":"Facebook","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103101,"name":"The Art of Changing Large Software Systems in Place","description":"Learn about the process of replacing pieces of infrastructure without disturbing engineers or users. This talk is based on lessons learned from rewriting the majority of the code that renders Facebook’s News Feed on Android with Litho (fblitho.com), a new and open sourced UI rendering framework from Facebook.","category":null,"startDate":"09/25/2017 10:50AM","endDate":"09/25/2017 11:30AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":25866,"name":"Jason Sendros","profile":"I've been working on the Facebook for Android app for the past 5 years. In that time, I've worked on scroll performance for News Feed and rewritten the rendering infrastructure for News Feed twice. I'm a Litho wizard, a scroll performance guru, and I am sometimes lucky enough to stumble my way through Flexbox.","avatarKey":"http://static.sched.org/a6/2148012/avatar.jpg.320x320px.jpg?68b","userCode":"07f2","company":"Facebook","twitter":null,"linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103022,"name":"Upgrading to Moshi","description":"Moshi is the successor to Gson. We will briefly contrast Moshi to Gson and explain the advantages of Moshi's API and implementation. We will cover the power of the streaming API for complex use cases, like polymorphic deserialization, and how Okio's types make building off of Moshi easy. Finally, we will go through how to use Moshi effectively with Retrofit and Auto-Value-Moshi and some tricks to employ when upgrading.","category":null,"startDate":"09/26/2017 09:50AM","endDate":"09/26/2017 10:30AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":8900,"name":"Eric Cochran","profile":"I strive to build delightful experiences for users' most personal devices. I love constantly learning and building new techniques, and Android provides both a great platform and an excellent community for devs.","avatarKey":"914c8d56-2038-4c2f-bec2-365e77cea795","userCode":"caa9","company":"Pinterest","twitter":"Eric_Cochran","linkedIn":null,"website":"nightlynexus.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103044,"name":"Tech Talks for Humans","description":"You're presenting the most interesting part of your tech talk when all of a sudden you notice someone fell asleep in the first row, half the room is yawning, and the other half is looking at their phone.\r\n\r\nCome learn how to build a talk to efficiently transfer your ideas into other people's brains!","category":null,"startDate":"09/25/2017 05:00PM","endDate":"09/25/2017 05:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":48700,"name":"Pierre-Yves Ricau","profile":"Android Baker @ Square. Enjoys good wine & gluten-free code.","avatarKey":"711425c2-5b6c-474a-8b72-594ec50b46ac","userCode":"f25f3","company":"Square","twitter":"","linkedIn":"","website":"http://cash.me/$hit/9999","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103046,"name":"Make Your App Instant!","description":"Instant Apps absorbs the best of both worlds: mobile web and native apps. Instant Apps is designed with speed, light weight, best UX and modularity in mind. Just like mobile web apps Instant Apps is very light and does not require installation. On the other hand, it provides a truly native user experience with material design and native navigation, which users are so used to.\r\n\r\nBuilding Instant Apps requires a lot of work on the architecture side, modularization and reducing the app size. Instant Apps types, architecture changes, project structure, size and feature constraints, practical tips to slim down the application, lessons learnt will be discussed during the talk.","category":null,"startDate":"09/26/2017 04:30PM","endDate":"09/26/2017 05:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":93950,"name":"Yuliya Kaleda","profile":"Yuliya is an Android developer at Jet.com, leading a team of 4 developers whose main focus is to build performant, scalable and cutting-edge Android projects. For the last few months Yuliya has been leading the development of the first multi-feature Instant Apps. Yuliya is actively involved at C4Q - non-profit organization, which fosters the tech community in NY.","avatarKey":"User_ce506a52-884b-4909-9e35-e9cac2f1ad13","userCode":"f6d34","company":"Jet.com","twitter":"@YuliyaKaleda","linkedIn":"https://www.linkedin.com/in/yuliya-kaleda-b4525ab1/","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":102850,"name":"Forum B","description":"","mapImageUrl":"","events":[{"id":102902,"name":"Developers Are Users Too","description":"For years, we’ve been looking at one type of consumer of our work: the end user - the one for whom we are developing our apps. Lately, the Android community has been growing and, most of all, it’s been collaborating! Code, blog posts and talks - for all these types of content that we are producing, the consumer is us. All of us! From code reviewers, team-mates, other developers that use our work, to the future “you” that needs to maintain the code.\r\n \r\nFor the first type of consumers we have specialized roles that advocate for them – like product owners and UI/UX designers – but for the second type, we don’t. As developers, it ends up being our responsibility to look at the content we are producing from the perspective of the target audience.\r\n \r\nLet’s take a look at the “content - consumer” relationship in the same way we look at the “app - end-user” relationship. Let’s see what kind of questions we need to answer to improve the quality of our work, satisfy our content consumers and, in turn, improve the end-user experience.","category":null,"startDate":"09/25/2017 10:00AM","endDate":"09/25/2017 10:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":61420,"name":"Florina Muntenescu","profile":"Florina is working as an Android Developer Advocate at Google, helping developers architect clean, testable apps using the Architecture Components libraries. She has been working with Android for 8 years, previous work covering news at upday, payment solutions at payleven and navigation services at Garmin.","avatarKey":"User_2d4c57e7-29db-462c-91be-07e02f24b6bb","userCode":"b5cdb","company":"Google","twitter":"FMuntenescu","linkedIn":"https://de.linkedin.com/in/florina-muntenescu-314b8921","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":102903,"name":"Android Architecture Round Table","description":"Google's new Architecture Components libraries make it easier to write robust apps and they come with a 'Guide to App Architecture'. However, there are many issues still to be solved by developers. Join architecture experts, including members of the Android Framework team, as they discuss the intricacies of working with the new components and using tools such as Dependency Injection frameworks, reactive libraries, etc.","category":null,"startDate":"09/25/2017 10:50AM","endDate":"09/25/2017 11:30AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":93150,"name":"Jose Alcérreca","profile":"Developer Programs Engineer @ Google, working on Architecture and Testing.","avatarKey":"User_56a2ae39-5695-4a54-8b01-793c389f9e0e","userCode":"15550","company":"Google","twitter":"ppvi","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":39952,"name":"Yiğit Boyar","profile":"Yigit is a software engineer on the Android Framework team focusing on app architecture and developer productivity. He also works on Data Binding and RecyclerView. Prior to joining Google, he was the Android Engineering Manager at Path.\r\n He received his bachelor's degree in computer engineering from Middle East Technical University, Turkey.","avatarKey":"41932f45-e999-4d01-926b-e79c35a3bbab","userCode":"b408c","company":"Google","twitter":"yigitboyar","linkedIn":"","website":"birbit.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103000,"name":"Get a Room","description":"One of the Android Architecture Components released at Google I|O 2017 was Room, Google's take on an object-relational mapping (ORM) engine. It offers a convenient, reactive API for working with SQLite or other SQLite-compliant databases (e.g., SQLCipher for Android). In this presentation, we will explore Room, both in terms of its basic integration into your app and some of the challenges and idiosyncrasies that it presents.","category":null,"startDate":"09/26/2017 02:40PM","endDate":"09/26/2017 03:20PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":92401,"name":"Mark Murphy","profile":"Author of \"The Busy Coder's Guide to Android Development\". Contributor of over 19,000 answers to Android questions on Stack Overflow. Developer of open source libraries. Presenter at conferences. Trainer of multitudes. Writer of sentence fragments.","avatarKey":"https://lh6.googleusercontent.com/-IgiwMkkI3_k/AAAAAAAAAAI/AAAAAAAAAAA/AAyYBF4UifkTEAdhXn3LWvnidnqIktUYnQ/s96-c/photo.jpg","userCode":"a512b","company":"CommonsWare","twitter":"commonsguy","linkedIn":null,"website":"https://commonsware.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103001,"name":"The Resurgence of SQL","description":"SQL may have fallen out of fashion over the last decade, but libraries like SQL Delight and Room are now placing it at the forefront of their use. As a language, SQL is more declarative and expressive than any ORM could hope to be. With the support of strong tooling, database interactions not only become easier but you're able to leverage more of its power.\r\n\r\nThis talk will be a re-introduction to the SQL language for those that have seen it before. We will focus on specific examples where you can offload work that would have otherwise been done in code into the database. Finally, we'll compare and contrast the SQL Delight and Room libraries.","category":null,"startDate":"09/25/2017 01:30PM","endDate":"09/25/2017 02:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":61400,"name":"Alec Strong","profile":"Android developer on Square Cash, creator of SQLDelight, uWaterloo grad, super smash bros melee competitor.","avatarKey":"https://lh4.googleusercontent.com/-eC99vA4gpcg/AAAAAAAAAAI/AAAAAAAAAB8/Q9oOoUnvfPg/s96-c/photo.jpg","userCode":"8c21d","company":"Square, Inc.","twitter":"Strongolopolis","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":5662,"name":"Jake Wharton","profile":"Android Framework engineer at Google working on Kotlin things.","avatarKey":"http://static.sched.org/a4/1356595/avatar.jpg.320x320px.jpg?ea8","userCode":"6d59","company":"Google","twitter":"JakeWharton","linkedIn":null,"website":"http://jakewharton.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103003,"name":"Data Binding in a Kotlin World","description":"If you like Butterknife, get ready to discover a whole new tool drawer. Data binding in 2017 is a stable framework that can drastically reduce boilerplate code and transform the way you write UI—even if you already use RxJava or Kotlin Android Extensions. Animate, transition, and respond to user input without cluttering your code. Add your own custom properties to Android’s View classes (like android:font or android:imageUrl)! We'll start at the very beginning with Kotlin support, discover tricks to supercharge your XML, and end in a deep dive to lambdas and two-way binding. No prior knowledge of data binding needed.","category":null,"startDate":"09/25/2017 03:10PM","endDate":"09/25/2017 03:50PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":24406,"name":"Lisa Wray","profile":"Lisa Wray is an Android developer, speaker, and advocate specializing in user interfaces. She has a B.S. from M.I.T. in music and computer science, and is an Android Google Developer Expert. She previously worked at Google on the Developer Relations team, at the New York Times, and at Genius, a Brooklyn-based startup, where she built their Android app from scratch. She currently lives in Seattle.","avatarKey":"User_3813fac3-68b1-487e-9432-5093d37640b3","userCode":"cda3","company":"Independent","twitter":"lisawrayz","linkedIn":null,"website":"xwray.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103007,"name":"No Internet? No Problem!","description":"At Off Grid Electric our mission is to power homes across rural Africa with affordable, solar energy. In order to do that we need to provide our employees with tools that work both on and offline. So how did we do it?\r\n\r\nIn this talk, learn about the techniques we employed to provide a unique online-offline experience in our Android applications. We’ll discuss the overall architecture, third party libraries used, and some of the challenges that we faced.\r\n\r\nAs more and more users come online in various parts of the world it makes sense for companies to begin exploring how they can modify their applications to be more network-friendly. This talk will get you headed in the right direction!","category":null,"startDate":"09/26/2017 09:00AM","endDate":"09/26/2017 09:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":92302,"name":"Moyinoluwa Adeyemi","profile":"Moyinoluwa is an Android Developer who enjoys exploring the latest technologies in Android Development. She loves sharing her knowledge by writing on Medium. She also cares a lot about building apps that look good and work well on all devices. She manages Yoruba Watch Faces, an Android application and a collection of watch faces that tell the time in Yoruba a Nigerian dialect.","avatarKey":"https://lh5.googleusercontent.com/-TWi-LhQKNCA/AAAAAAAAAAI/AAAAAAAASxc/vv6YXao_IpU/s96-c/photo.jpg","userCode":"3ecde","company":"Off Grid Electric","twitter":"moyheen","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":25870,"name":"Annyce Davis","profile":"Annyce is an Android Google Developer Expert. She has spent the past 6+ years developing applications for the Android ecosystem across multiple form factors. She is also a international conference speaker and author, sharing her knowledge of Android development with others. In addition, Annyce is active in the Washington, DC tech scene and assists with running a local meetup focused on Android development and design.","avatarKey":"User_bb319a7b-ce25-422d-af95-2670d476f1e4","userCode":"f1aa","company":"Off Grid Electric","twitter":"brwngrldev","linkedIn":"https://www.linkedin.com/in/annycedavis","website":"http://adavis.info","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+AnnyceDavis","nickname":null,"coverKey":"94318692-36a5-4896-999e-78dca26e62a9_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":103010,"name":"Elevated UX: How the foundations of Material Design influence user experience","description":"From a high level, Material Design can be perceived as a pyramid of interaction mechanics, patterns, conventions, and styled components, but the foundational principles that permeate each component subtly influence how a user experiences your app. This session will unpack the principles that work at a low level to make Material Design a strong system and how they lay the groundwork for great user experiences.","category":null,"startDate":"09/26/2017 11:50AM","endDate":"09/26/2017 12:30PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":25871,"name":"Liam Spradlin","profile":"Liam is a UIUX designer based in NYC. He's helped independent developers, startups, global corporations, and civic organizations invent or improve innovative, human-centered experiences, and has spoken internationally about the future of UIUX. Liam is currently a design advocate at Google, enabling great design across platforms.","avatarKey":"http://static.sched.org/a6/2148006/avatar.jpg.320x320px.jpg?c5e","userCode":"5d42","company":"Google","twitter":null,"linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103002,"name":"The Road to Kotlintown","description":"Even if you’re brand new to Kotlin, you might know that you can right-click any Java file and convert it automatically. Score! But wait, what are all these “!!” and why is the code littered with “?”. Sure, the code compiles, but how do you make the code not just compile but follow best practices? How do you get closer to making your code idiomatic?\r\n \r\nIn this talk we are going to discuss how you can get started in Kotlin by converting current code and adding new code, how to make that code more Kotlin-esque, including some good practices and some things to avoid. Hopefully, you will leave this talk being able to get over those bumps and speed your way to Kotlintown.","category":null,"startDate":"09/25/2017 11:40AM","endDate":"09/25/2017 12:20PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":49250,"name":"Christina Lee","profile":"Christina is currently working on making video a reality at Pinterest. In addition to trying to convince the world to use Kotlin on a daily basis, she also enjoys building beautiful UI’s, extolling the virtues of Rx, and reading well documented APIs.","avatarKey":"User_3881e913-0c51-4a8c-86b8-cdc99c05ee53","userCode":"a6c0c","company":"Pinterest","twitter":"RunChristinaRun","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":8510,"name":"Huyen Tue Dao","profile":"Huyen Tue Dao is an Android developer and Google Developer Expert, currently working on the Trello Android app at Atlasssian. She is co-creator of the \"Android Dialogs\" YouTube channel.\r\n\r\nHuyen lives in Denver, CO though is often found in the DC Metro area. When she is not up late programming, she is often found up late gaming (video, board, card, anything).","avatarKey":"User_c6ac00df-1f21-48e1-a0e1-0237b3e050f8","userCode":"b059","company":"Trello","twitter":"queencodemonkey","linkedIn":"https://www.linkedin.com/in/huyentuedao/","website":"randomlytyping.com","email":null,"phone":null,"phoneticName":null,"gPlus":"+HuyenTueDao","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103006,"name":"How Espresso Works","description":"Espresso is a key part of the Android Test Support Library from Google. \r\nEspresso can be a great tool for automating UI testing. Come learn about the internals of how Espresso works. This will help you write fast, reliable tests, and better troubleshoot tests when they fail. You will learn about ViewActions, ViewAssertions and IdlingResources.","category":null,"startDate":"09/25/2017 02:20PM","endDate":"09/25/2017 03:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":15711,"name":"Michael Bailey","profile":"Michael is a Google Developer Expert and a Principal Engineer on the Android team responsible for American Express’ flagship consumer Android apps in the U.S. market. Development on these apps began in 2010. Since joining the company in 2008, Michael has worked on a number initiatives at American Express including analytics, enterprise content management, AmexLabs, iOS apps, international mobile applications, NFC payments, the U.S. homepage and the U.S. online card applications site. Michael holds a BS in Computer Science from Harvey Mudd College and an MS in Computer Science from the University of Southern California, where he specialized in computer security. Including the U.S. consumer apps that Michael works on, American Express has 8 Android apps in the U.S. Google Play Store (https://play.google.com/store/apps/developer?id=American%20Express) and more in the international Play Stores.","avatarKey":"da8a4c5f-76bb-4532-89c6-14f1a6b5a8cd","userCode":"31e6","company":"American Express","twitter":"yogurtearl","linkedIn":"https://www.linkedin.com/in/michaeljbaileyyogurtearl","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103014,"name":"Asynchronous Dependency Injection","description":"Dependency injection is a useful pattern for writing modular code, but by design it requires an object's dependencies to created first, which adversely impacts your app's startup time. One solution is to use asynchronous dependency injection to create dependencies on background threads, in parallel. There are two main strategies for accomplishing this goal: Dagger Producers and RxJava with Dagger. This talk will focus on migrating slow dependencies to Dagger Producers to improve app performance.","category":null,"startDate":"09/26/2017 03:40PM","endDate":"09/26/2017 04:20PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":36422,"name":"Eric Leong","profile":"I'm a senior Android engineer at Tumblr.","avatarKey":"8b74156b-63ff-425b-9897-a035d971fd9c","userCode":"b8a58","company":"Tumblr","twitter":"ericwleong","linkedIn":"https://www.linkedin.com/in/eric-leong-92347145","website":"http://ericleong.me","email":null,"phone":"","phoneticName":null,"gPlus":"https://plus.google.com/u/0/103746199749981693463","nickname":null,"coverKey":"f357cd44-68a2-4a6f-bdff-346a2421c5a5_cover","facebook":"","emailPublic":false,"following":false}]},{"id":103009,"name":"One for all, all for one: The Journey to Android Monorepo at Uber","description":"Managing code across multiple repositories at scale impedes developer productivity, comes with a cost of duplication of tooling, processes and dealing with breaking api changes in non atomic change-sets. At Uber, the Android codebase moved from 100+ repositories into a single monolithic repository. This massive migration was done while ensuring VCS history is preserved, breaking API changes across repositories are mitigated, build tooling and infrastructure are scalable and developer workflows are minimally impacted. In this talk, Gautam will deep dive into why the decision was made, the tooling needed to support it, how it was executed and the developer productivity wins that came as a result.","category":null,"startDate":"09/26/2017 09:50AM","endDate":"09/26/2017 10:30AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":64250,"name":"Gautam Korlam","profile":"I lead the Android Developer Experience Team at Uber. I am very passionate about tooling, infrastructure and build systems for building android apps at scale.","avatarKey":"https://lh6.googleusercontent.com/-lEtSGEshfdE/AAAAAAAAAAI/AAAAAAAAAfg/gead8R8Wr8g/s96-c/photo.jpg","userCode":"be5bb","company":"Uber","twitter":"","linkedIn":"https://www.linkedin.com/in/gautamkorlam","website":"https://github.com/kageiit","email":null,"phone":"","phoneticName":null,"gPlus":"","nickname":null,"coverKey":null,"facebook":"","emailPublic":false,"following":false}]},{"id":103011,"name":"Building for Android Oreo","description":"Android Oreo has changed the way apps work in the background, so this talk walks through techniques to implement common app use cases in this new world, along with highlighting a few Oreo features you should make sure to take advantage of.  Since some of these changes restrict the behavior of apps that don't even target Oreo, you'll want to make sure to adapt for this new world to get the behavior you expect.","category":null,"startDate":"09/26/2017 01:00PM","endDate":"09/26/2017 01:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":93154,"name":"Dan Galpin","profile":"Dan Galpin has been working on Android at Google since 2010, leading development of our Udacity courses and working to make the Android ecosystem better for game developers.  He currently leads the scalable advocacy team.","avatarKey":"https://lh3.googleusercontent.com/-DpJ9_MmqW8c/AAAAAAAAAAI/AAAAAAAAEqg/M7zW0YAvbDc/s96-c/photo.jpg","userCode":"d51bc","company":"Google, Inc.","twitter":"dagalpin","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":"google.com/+dangalpin","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103012,"name":"App Development - Pragmatic Best Practices","description":"A talk by Yigit Boyar (@yigitboyar) and Israel Ferrer Camacho (@rallat).\r\n\r\nIn this talk, we want to share best practices to overcome those challenges every app has.\r\nWe shared a survey asking over a 100 Android devs about their biggest challenges in Android app development (https://goo.gl/forms/QazA4OJUGzs7kCKj2). From analyzing the data from the survey, common challenges surfaced. \r\n\r\nFirst, we'll talk about best practices in app organization, architecture, and testing. After that we will be tackling some of Android's specific challenges like supporting OS versions, configuration changes, updating UI with live data (network, database), Fragments, concurrency and testing.\r\n","category":null,"startDate":"09/26/2017 01:50PM","endDate":"09/26/2017 02:30PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":39952,"name":"Yiğit Boyar","profile":"Yigit is a software engineer on the Android Framework team focusing on app architecture and developer productivity. He also works on Data Binding and RecyclerView. Prior to joining Google, he was the Android Engineering Manager at Path.\r\n He received his bachelor's degree in computer engineering from Middle East Technical University, Turkey.","avatarKey":"41932f45-e999-4d01-926b-e79c35a3bbab","userCode":"b408c","company":"Google","twitter":"yigitboyar","linkedIn":"","website":"birbit.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":39104,"name":"Israel Ferrer Camacho","profile":"Israel Ferrer Camacho is an Android engineer working at Twitter. Passionate about Android, object-oriented design principles, testing and agile methodologies.","avatarKey":"88565d99-bdbc-42da-acfc-b9b37b997fd9","userCode":"d66e1","company":"Twitter","twitter":"rallat","linkedIn":null,"website":"http://israelferrer.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103033,"name":"Becoming a master window fitter 🔧","description":"Window insets have long been a source of confusion to developers, and that’s because they are indeed very confusing! The system dispatches Insets for many reasons, such as drawing behind navigation bars, full-screen immersive modes or handling round displays. This session will deep-dive on the situations where you need to consider Window Insets, and how you can handle them without resorting to copying random code from StackOverflow.\r\n \r\nYou will learn the answers to questions such as:\r\n‘How do I handle these in my custom view?’,\r\n‘How do I draw behind the status bar?’ and\r\n‘What was the developer of AppBarLayout thinking?!’","category":null,"startDate":"09/25/2017 04:10PM","endDate":"09/25/2017 04:50PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":31724,"name":"Chris Banes","profile":"Chris is an engineer working on the Android Support Libraries at Google, most notably AppCompat, Design lib and Palette. He has worked on Android things for over 6 years, from open source libraries to media apps, social networks and most stuff in between.","avatarKey":"User_e4c397a4-a459-40c3-b794-be839cf01de0","userCode":"9494e","company":"Google","twitter":"chrisbanes","linkedIn":null,"website":"https://chris.banes.me","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+ChrisBanes","nickname":null,"coverKey":"17ea5d03-e431-43c4-b05b-22c7a3652f5c_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":103035,"name":"Vector Workflows ⿻","description":"Vector assets are lightweight and sharp on every screen size but working with them can be complicated. Android doesn’t directly support SVG; potentially leading to conversion and ownership issues.\r\n\r\nThis talk will cover what designers and developers need to know to work together to create static and animated vector assets. We’ll cover the capabilities of Android’s vector formats, how they influence producing assets in graphics packages (with a focus on Sketch) and how to efficiently export them. We'll also look at tooling and workflows that allow designers and devs to collaborate on creating vector animations.","category":null,"startDate":"09/26/2017 11:00AM","endDate":"09/26/2017 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":30903,"name":"Nick Butcher","profile":"Nick is an Android designer & developer who helps other designers and developers to understand and create beautiful material design apps.","avatarKey":"a84e76d8-ba63-4962-a804-d564ff06603e","userCode":"0802b","company":"Google","twitter":"crafty","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":"NickButcher","nickname":null,"coverKey":"b323f6f1-a634-43d9-b470-e4f42d9acae1_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":103041,"name":"Mastering Android’s App Resources","description":"Android app resources when used correctly can be an Android developer’s best friend.  When a developer embarks on implementing an app, knowing how to lay things out efficiently makes it easier to adapt one screen to any device, be it mobile, TV or a wearable. Not only can you use Android’s resource types for designing responsive apps but you can also use them to define colors, animations, drawables, layouts as well as the newly introduced fonts resource type in Android O preview!\r\n\r\nIn this talk, you will learn about\r\n* the various Android resource types at your disposal\r\n* providing alternative resources when you need to support multiple devices and locales\r\n* the precedence of resource qualifiers when there are alternative resources\r\n\r\nWe will go through several code samples to better understand how Android’s resource system works so that it’s easier to make implementation decisions for one design on different screens. This talk is geared towards developers as well as designers interested in knowing how their designs get translated in the Android world.\r\n","category":null,"startDate":"09/25/2017 05:50PM","endDate":"09/25/2017 06:30PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":12014,"name":"Yash Prabhu","profile":"Yash Prabhu leads the Android team at Warner Bros. Digital Labs (formerly DramaFever) and has been developing Android apps since 2010. She has spoken at several Android meetups and conferences over the past three years. In her spare time, she volunteers at Girl Develop It Philadelphia and Code For Philadelphia as a teaching assistant and mentor. She also co-organizes Google Developers Group Philadelphia.","avatarKey":"User_3e63d82d-ea7d-4716-8d23-d989ee34b5f2","userCode":"a21d","company":"Warner Bros. Digital Labs","twitter":"yashvprabhu","linkedIn":null,"website":"yprabhu.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103256,"name":"Creating the Lyft Driver App: Reduce, Reuse, Recycle","description":"Originally Lyft was introduced as a single app where users could switch to between driver and passenger modes in order to give and recieve rides. There were advantages at the beginning to having only one app with multiple modes, but after time this bloated the app size and decreased the rate that we could create and release new features. Splitting these two modes (one into a Passenger app and one into a Driver app) could be done in a few ways, but we settled upon using the modularization of various apsects of the code for the task.\r\n\r\nThis talk will discuss the architecture and execution of this modularization used in order to release the Lyft Driver app.","category":null,"startDate":"09/26/2017 04:30PM","endDate":"09/26/2017 05:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":103350,"name":"Ryan Tempas","profile":"Ryan is an Android Engineer at Lyft. He is a member of the Driver Experience Team, contributing to many new features that drivers depend in their day to day lives. Some of these include the Amp (driver dashboard device), Driver App, Scheduled Pickups and Carseat mode. Ryan previously worked at Microsoft, creating a platform for Android apps to run natively on Windows, and on a Microsoft Office mobile incubation project.","avatarKey":"User_69e6982e-8a62-4684-8d4a-fa2cddc2793f","userCode":"","company":"Lyft","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103103,"name":"IoT for Android Developers","description":"Android Things is an exciting platform for Android developers because it enables building smart, connected devices using the same frameworks and tools they are familiar with. But there can also be a bit of a learning curve in transitioning from mobile development to working in IoT. Suddenly, you are responsible for the hardware that goes into the device, and determining how you are going to communicate with it! In this presentation we will explore the basics of interacting with hardware peripherals and protocols, and some of the tips and tricks for building an Android app that runs on an embedded device.","category":null,"startDate":"09/25/2017 05:00PM","endDate":"09/25/2017 05:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":93251,"name":"Dave Smith","profile":"Dave Smith is a Developer Advocate at Google, focused on IoT and the Android Things platform. Over the past decade he has worked with low power M2M systems and wireless radio links, and also built custom applications and system components to run Android on embedded platforms. He has a passion for finding opportunities to make devices, and developers, smarter.","avatarKey":"User_b9372443-c6ee-42c0-9523-46e3030d22e5","userCode":"de782","company":"Google","twitter":"devunwired","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":102852,"name":"Hub One","description":"","mapImageUrl":"","events":[{"id":103005,"name":"Lint to the Finish Line","description":"With the release of Android Gradle Plugin 3.0, Lint will have changed quite a bit.\r\n\r\nIn this talk, we'll:\r\n* Learn about the Unified AST (UAST)\r\n* Hash out the differences between UAST, PSI and Lombok\r\n* Go through examples of custom lint checks with quick fixes\r\n* ...and more!\r\n\r\nYou’ll learn enough to write your own lint checks in no time flat!","category":null,"startDate":"09/25/2017 03:10PM","endDate":"09/25/2017 03:50PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":30201,"name":"John Rodriguez","profile":"John Rodriguez is an Android engineer on the Developers team at Square.  Contributor to LeakCanary.  Previously at Amplify and Major League Baseball.","avatarKey":"c7839fea-60f8-4398-bb46-03ed98603fdb","userCode":"df7d0","company":"Square","twitter":"jrodbx","linkedIn":"https://www.linkedin.com/in/jrodbx/","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103034,"name":"Stricter StrictMode","description":"Android O adds even more strict mode detectors. Learn why every developer should have strict mode turned on in their dev builds and how it can help improve the excellence of your app.","category":null,"startDate":"09/25/2017 02:20PM","endDate":"09/25/2017 03:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":91900,"name":"Kurt Nelson","profile":"Kurt has taught Android at many of the largest tech companies and currently works on the Android App Frameworks team at Google.","avatarKey":"https://lh3.googleusercontent.com/-F9r-D3i42zk/AAAAAAAAAAI/AAAAAAAAYYk/leafYaMCjEQ/s96-c/photo.jpg","userCode":"ee0f3","company":"Google","twitter":"kurtisnelson","linkedIn":null,"website":"thisisnotajoke.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103025,"name":"Android Internals for Developers","description":"What actually happens when my code calls Android APIs? We all know about onCreate, but who actually calls my method? In this talk, we're going to go behind the curtain and look at AOSP itself. We're going to dig into the internals of how Android OS manages the apps that we write and see: \r\n- How Intents work and how they get resolved\r\n- How our app works together with other Intents, Activities, Services, and Content Providers in features such as sharing\r\n- How the app lifecycle is being managed by the system\r\n- How these features are built on top of the built-in Linux primitives such as processes and Linux user accounts.","category":null,"startDate":"09/26/2017 01:50PM","endDate":"09/26/2017 02:30PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":45951,"name":"Effie Barak","profile":"I work at Pinterest as a Senior Android developer on the Core Experience team. Before that I was a Senior Android developer at Udemy, responsible for the Android app development and leading the development of the Android TV prototype.  \r\n\r\nI began working as a C# developer 10 years ago. I became a mobile developer 4 years ago, and released many Windows and Windows Phone apps. After moving to San Francisco in 2013, I worked for Slack on the Windows Phone app.","avatarKey":"User_029ac050-382c-4efd-af14-41526303415a","userCode":"b73fd","company":"Pinterest","twitter":"CodingChick","linkedIn":null,"website":"effie.io","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103104,"name":"Instant Apps + Deep Linking 101","description":"It can be tough to understand what data needs to be contained inside of your Instant App links, how to configure them, and how they can work across your full native app and your Instant App. Branch links are easy to implement, and take care of both native and Instant App linking requirements. Stop by this workshop for hands-on guidance and learn exactly how to implement the details of your Instant App links with Branch quickly and easily.","category":null,"startDate":"09/26/2017 11:00AM","endDate":"09/26/2017 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":28202,"name":"Evan Groth","profile":"Evan Groth is a Product Engineer at Branch, the leading mobile linking platform backed by Andy Rubin's Playground Ventures with solutions to unify user experiences and measurement across channels, devices, and platforms. Evan works on Branch's internal experimental projects, rapidly prototyping ideas with the potential to shape mobile linking and the broader ecosystem. In addition, he contributes to Branch's Android SDK whether it be a feature request, bug fix, or GitHub discussion. He was the company's first Developer Evangelist and still loves to attend as many Android events as possible.","avatarKey":"User_6b62506f-e632-42bc-ad4d-dabafac76e32","userCode":"2b0e","company":"Branch Metrics","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103040,"name":"Debugging without a Stacktrace: Using Android Studio’s Performance Monitors","description":"What do you do when your app freezes up, becomes unresponsive, and the logcat just isn’t being helpful? I found myself in this exact situation while debugging a music player I’m currently developing. This talk will walk through a real world crash that doesn't output a stacktrace, and how to debug and get more information using Android Studio’s performance monitors.","category":null,"startDate":"09/26/2017 09:50AM","endDate":"09/26/2017 10:30AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":76800,"name":"Andrew Orobator","profile":"Andrew taught himself Android in 2014 when he started working on Auracle Music Player (now in beta). Currently, he works as an Android developer for 7Park Data. Prior to working at 7Park Data, he designed and taught a beginner’s course on Android development at Carnegie Mellon University. When he’s not working on Auracle or writing a blog post, you can find Andrew on the dance floor busting a move, or at a karaoke bar singing to his heart’s content.","avatarKey":"User_21c05f50-9c5b-45a6-8b32-105fae3b47d5","userCode":"1afd3","company":"7Park Data","twitter":"AOrobator","linkedIn":"https://www.linkedin.com/in/andrew-orobator-78031939","website":"https://medium.com/@andreworobator","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103019,"name":"GraphQL on Android is here!","description":"We at the New York Times needed an android graphql client and Facebook has not yet open sourced one.  We worked with partners to create Apollo, a graphql library for android. Here's how we use it! And you can to!","category":null,"startDate":"09/25/2017 05:00PM","endDate":"09/25/2017 05:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":80228,"name":"Brian Plummer","profile":"Android developer at the New York Times.","avatarKey":"","userCode":"b87dc","company":"NYTimes","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":82651,"name":"Mike Nakhimovich","profile":null,"avatarKey":"User_8a3c65a8-f1a1-43bd-9a09-13f3e64da4bd","userCode":"b853c","company":"Ny times","twitter":"Friendlymikhail","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103026,"name":"Refactoring in Android Studio","description":"Ever wondered what the Refactor tab does in Android Studio? In this session we'll go through the refactoring options in Studio and show you how applying them to your code will improve it's maintainability, scalability and overall design.  We'll also use refactoring on a sample app to show how to go from a classic Android architecture to the new Google reference architecture.","category":null,"startDate":"09/25/2017 10:50AM","endDate":"09/25/2017 11:30AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":25855,"name":"Godfrey Nolan","profile":"Godfrey is founder and president of RIIS LLC, a mobile development firm in the Detroit Metro area. He is also author of \"Bulletproof Android\", \"Android Best Practices\", \"Decompiling Android\" and \"Decompiling Java.\" Godfrey has spoken at several AnDevcons as well as JavaOne, ASP-Connections, VSLive, Codemash, Code PaLOUsa, 1DevDay and many local Java and .Net user groups on a wide range of topics such as Continuous Integration, Executable Requirements and mobile security.","avatarKey":"User_7ca0d878-52b3-46c2-9149-d64f92149726","userCode":"b1dc","company":"RIIS LLC","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103030,"name":"Model View Intent, Embracing Reactive UI's","description":"Juggling several Rx streams at the same time is incredibly difficult. Model, View, Intent (MVI) is an iteration on the MVP model that fills in some gaps around how to handle multiple streams within one's presenter. It also solidifies the concept of a \"State reducer\" within the context of android applications. MVI is a spin on various reactive architectures from the web space adapted to solve some of the challenges when building android applications. ","category":null,"startDate":"09/25/2017 10:00AM","endDate":"09/25/2017 10:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":77453,"name":"Yousuf Haque","profile":"Yousuf Haque is a developer. He writes Android apps, web services, and when no one is looking, browser apps. Lately he finds himself equipped with a hammer called Kotlin, and a very liberal definition of what constitutes a nail.","avatarKey":null,"userCode":"90b1d","company":null,"twitter":"yousufhaque","linkedIn":"https://www.linkedin.com/in/yousuf-haque-b2b6215b/","website":"yhaque.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103032,"name":"Driver Assistant Solutions with Android","description":"One of most exciting engineering challenges today is building a reliable self-driving car or driving support system. \r\nToday's vehicles offer a huge variety of sensors that can feed any algorithm with enough data to provide a pretty solid driving support experience. On top of this, despite some differences, smartphones sensors are robust enough to provide a rich set of environmental information.\r\nDuring this presentation, we'll discover how to implement computer vision solutions on Android with OpenCV, and how to mash-up device and vehicle data to build a driver assistant solution with open source technologies.\r\n\r\n","category":null,"startDate":"09/25/2017 11:40AM","endDate":"09/25/2017 12:20PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":61802,"name":"Giorgio Natili","profile":"On paper, Giorgio is an engineering lead at Akamai Technologies where he spearheads the implementation of the new web apps for the security products line of Akamai and leads the development of a mobile SDK. On the job, Giorgio is a strong proponent of agile development practices whose passion for usable, maintainable and testable code is only surpassed by his determination to make things work. His previous speaking engagements include Adobe Max, 360|Flex, FITC, Mobile Web Dev Conference, Mobile Tea, Droidcon, etc.","avatarKey":"https://lh5.googleusercontent.com/-fmiDVop838A/AAAAAAAAAAI/AAAAAAAAAAo/5fszW1_LWAw/s96-c/photo.jpg","userCode":"3fc50","company":"Droidcon Boston Organizer","twitter":"giorgionatili","linkedIn":"https://www.linkedin.com/in/giorgionatili","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103039,"name":"Model-View-Intent for Android","description":"Development on Android inevitably involves asynchronous sources, which includes the network, the framework or even the user. This easily leads to a complex architecture and a state that is difficult to manage. Are you comfortable with your users rotating the screen while waiting for a network response? What will happen when multiple requests hit the network at the same time?  \r\nThe Model-View-Intent architecture, borrowed from the web, is all about streams: listening to asynchronous sources, processing the information, and displaying the result. In this architecture, everything is a stream. However, Android is a multi-threaded platform and this introduces additional complexity that we have to take into account when applying the MVI pattern. Unidirectional data flow allows one to focus on a unique source of truth and by embracing immutability, there is no need to worry about data being mutated by other parts of the code. By abstracting away the common pitfalls of state management in Android, this architecture allows the developer to focus on the logic of the app, making it easy to write and easy to maintain.  \r\nIn this talk, we’ll look at how, with Kotlin and RxJava, this reactive architecture can help the developer write a complex UI with concrete examples, including parallel network requests, config changes, SnackBars and more.\r\n","category":null,"startDate":"09/26/2017 09:00AM","endDate":"09/26/2017 09:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":92001,"name":"Benoît Quenaudon","profile":"Benoît is an Android developer at Cybozu, based in Japan. He focuses on providing the best Android experience possible, both to customers and fellow developers.","avatarKey":"User_34df6b71-51f2-4703-96b9-5bf6d6d403ba","userCode":"d0efa","company":"Cybozu","twitter":"oldergod","linkedIn":null,"website":"https://benoitquenaudon.com/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103043,"name":"Have Your Cake and Eat It Too with A/B Testing","description":"Nobody wants to waste time building features that won’t be successful. Unfortunately, it’s often difficult to anticipate users’ reactions and once your feature is out in the wild, it’s hard to iterate and gauge the right direction to take a failing feature — are users finding it difficult to use? Maybe they just can’t find it within your app? Or maybe the UI doesn’t invoke engagement? \r\n\r\nEnter A/B testing: try out variations on the same feature with different segments of your user base, make changes on-the-fly without a new release, and have the data to back up what works best for your users. Enable your team to make confident, data-driven decisions to bring about the success of your features. The Capital One Wallet teams have actively been integrating A/B tests into new features and we’ve had successes even with seemly-insignificant A/B tests -- for example, slightly tweaking push notification text through A/B tests has led to a 5-10% increase in our notification clickthru rates! \r\n\r\nIn this talk, you’ll learn the different types of A/B tests which can be conducted and some best practices around A/B testing -- how should you be testing? And when is it appropriate? You’ll learn some of the considerations of A/B testing that come specifically with Android and you’ll also see some examples of using third party libraries -- including Firebase Remote Config and Swrve. Get the best tips on how to choose a third party library to eliminate \"gotchas\" and even gain insight towards building an in-house solution.\r\n\r\nEmbrace your indecisiveness, try all the possibilities, and maximize the potential of your future features.","category":null,"startDate":"09/26/2017 01:00PM","endDate":"09/26/2017 01:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":81772,"name":"Nick Capurso","profile":"Nick’s experience with Android spans back to Ice Cream Sandwich, initially working heavily with location, inertial sensors, and Bluetooth. He has published peer-reviewed papers, including one on modifications to the AOSP, which was accepted into the IEEE IoT Journal. Aside from Android, Nick's interests also include IoT, operating systems, and teaching undergraduates at The George Washington University.","avatarKey":"User_5d2775fd-4f32-4491-a084-237bff79d867","userCode":"2fdef","company":"Capital One","twitter":"nickcapurso","linkedIn":"https://www.linkedin.com/in/nickcapurso/","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103045,"name":"Clean app design with Architecture Components","description":"Handling lifecycle events, maintaining view state, and persisting data are all common challenges on Android that have contributed to the widespread adoption of clean architecture patterns like MVC, MVP, and MVVM.\r\n\r\nAndroid Architecture Components is a new collection of libraries to help developers manage these same nagging issues. This talk explores how components like Lifecycle, ViewModel, LiveData, and Room can be leveraged in an app already using clean architecture principles to help make your code even more robust, maintainable, and testable.","category":null,"startDate":"09/26/2017 02:40PM","endDate":"09/26/2017 03:20PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":5688,"name":"Chuck Greb","profile":"Open source aficionado, test-driven evangelist, and clean code connoisseur. Android Artisan @ Button.","avatarKey":"User_4ba5b1c2-6533-4813-98ce-82952d173fc1","userCode":"58c6","company":"Button","twitter":"ecgreb","linkedIn":null,"website":"developers.usebutton.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103047,"name":"Sentinel - The First Home Security Robot Powered by Android Things","description":"On this talk, Oscar tells us about the development of Sentinel, the first home security robot powered by Android Things, about his experience so far with Android Things plus several tips that will prove valuable for IoT beginners.","category":null,"startDate":"09/26/2017 04:30PM","endDate":"09/26/2017 05:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":12824,"name":"Oscar Salguero","profile":"Oscar started coding at 12 and has worked in companies of all sizes across the continent, he has co-founded startups, and worked with a wide range of technologies, worked as a Java Web Developer for 10 years and since 2008 he has been creating native iOS and Android apps; software written by him is installed in 50+ countries and serves millions of users.","avatarKey":"User_eef89177-1cd6-4428-971e-0672569f057a","userCode":"c874","company":"BeenVerified.com","twitter":"OscarSalguero","linkedIn":"https://www.linkedin.com/in/oscarsalguero/","website":"https://oscarsalguero.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103008,"name":"Getting to 100% Kotlin: A practical guide","description":"A lot of teams are super excited by Kotlin and are ready to go all-in with it. But while exciting, it can also be stressful — learning a brand new language while converting old code and writing new features, all at the same time? How does a team get there as smoothly as possible?\r\n\r\nWe’re here to help! At Basecamp we’ve worked hard to make our codebase 100% Kotlin over the course of the last year. We learned a lot and want to share a roadmap of how you can get there too.\r\n\r\nIf you're just starting out with Kotlin but can already see its potential, this talk is for you. We’ll share our best overarching strategies and tips based on a year of real-world shipping — how to get started, how to keep moving forward, and pitfalls to keep an eye out for. No theory here, this is all based on our actual experiences getting to 100% Kotlin.","category":null,"startDate":"09/25/2017 01:30PM","endDate":"09/25/2017 02:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":90656,"name":"Dan Kim","profile":"Dan has been an Android programmer at Basecamp for 3 years, and prior to that had been working on Java for well over a decade. \r\n\r\nHe's always enjoyed Android development, but Kotlin has rocketed that enthusiasm to a whole new level. Having worked with Kotlin since it hit 1.0, he can't get enough of it (and won't shut up about it either!) It's the first time he's truly enjoyed a programming language.\r\n\r\nOutside of work, he's an avid Dad, donut aficionado, pizza lover, and emoji enthusiast. 👴🍩🍕😉","avatarKey":"https://lh4.googleusercontent.com/-loE-dPTRRlA/AAAAAAAAAAI/AAAAAAAADhU/H3rZCbIIsNM/s96-c/photo.jpg","userCode":"aa7b7","company":"Basecamp","twitter":"dankim","linkedIn":null,"website":"https://medium.com/@lateplate","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103258,"name":"Deep Linking for Instant Apps Made Easy","description":"Deep links are nothing new to Android, but Instant Apps bring a fresh new user experience to deep linking. With the advent of Instant Apps, what changes for deep links? It's more important than ever to make sure that users get the best experience by taking advantage of the functionality of Instant Apps. We’re working directly with Google during its Instant App beta to set up Full App deep linking and conversion tracking. Learn the best way to leverage deep links for Instant Apps at at our workshop - learn about how (and why) it works, and how leading apps are already making use of the Branch <> Instant Apps integration to create better experiences and make sense of new users.","category":null,"startDate":"09/26/2017 11:50AM","endDate":"09/26/2017 12:30PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":28202,"name":"Evan Groth","profile":"Evan Groth is a Product Engineer at Branch, the leading mobile linking platform backed by Andy Rubin's Playground Ventures with solutions to unify user experiences and measurement across channels, devices, and platforms. Evan works on Branch's internal experimental projects, rapidly prototyping ideas with the potential to shape mobile linking and the broader ecosystem. In addition, he contributes to Branch's Android SDK whether it be a feature request, bug fix, or GitHub discussion. He was the company's first Developer Evangelist and still loves to attend as many Android events as possible.","avatarKey":"User_6b62506f-e632-42bc-ad4d-dabafac76e32","userCode":"2b0e","company":"Branch Metrics","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103031,"name":"Rule Your Realm","description":"At Blue Apron, we've been using Realm's mobile database to cache data for our app. We've been pleased with Realm's performance overall, but it has a few serious issues we've encountered. Notably, Realm doesn't play nicely with partial updates of model objects, or offer support for cascading deletes.\r\n\r\nIn this talk, Tom will cover what Realm is and why we chose it, as well as explaining these drawbacks and how we've worked around them. You'll learn about how Blue Apron has decoupled our server and client data models, as well as how we've handled deleting orphaned objects. After this talk, you'll be equipped to become the ruler of your own Realm!","category":null,"startDate":"09/26/2017 03:40PM","endDate":"09/26/2017 04:20PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":81769,"name":"Tom Wilson","profile":"Tom is currently the Lead Android Engineer for Blue Apron, where he focuses on building out an amazing experience for Android users to manage their deliveries, see tasty recipes, and more.\r\n\r\nIn a previous life, Tom was the tech lead of the Android SDK for Google Play Games Services. He was one of the founding members of the Google Play Services team, and helped launch that project to provide awesome services to Android developers more easily.","avatarKey":"User_783ef2d9-f4c9-4ef6-857e-0f91017f6bd9","userCode":"aa03a","company":"Blue Apron","twitter":"tmtrademark","linkedIn":null,"website":"www.blueapron.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103037,"name":"Reactive, Clean Architecture and Android Architecture Components, a solid formula for a MVVM based architecture. ","description":"Reactive development that links long-lived objects with pure functions is hot for good reason. Clean architecture helps with the separation of concerns making our code unit testable and separated from the framework. The recently released Android Architecture Components, and more specifically, the LiveData and ViewModel, make it easy to connect to the framework. If we mix this three and add some sparks of Dagger on top we get a solid formula for a Model-View-ViewModel based architecture. \r\n \r\nThe talk starts with a reminder of the characteristics any good architecture should have. This characteristics include: testability, separation of concerns, modularity,  among some other good practices. The next step is to cover the three layers from clean architecture:\r\n\r\n- Data: This is the layer that keeps the entities. We’ll show how to create a fully reactive data layer that serves the entities in streams.\r\n- Domain: This is a connection layer that holds the business logic to create use cases. We’ll show how to make it stateless and 100% free of framework code.\r\n- Presentation: This is the layer where the new LiveData and ViewModel classes come into play. We will show how to transform the use cases from the domain layer into view specific models using the new android architecture components.\r\n \r\nThe goal of the talk is to provide insights and guidelines on how to build a solid MVVM based reactive architecture. There will be links to meaningful resources that will cover the topics of the talk, like a GitHub example project and blog posts. \r\n","category":null,"startDate":"09/25/2017 04:10PM","endDate":"09/25/2017 04:50PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":80246,"name":"Lucia Payo","profile":"Lucia is a Senior Android developer currently working in N26. She is passionate about architecture and how to apply functional reactive programming concepts to Android development. In her free time she also likes to play videogames.","avatarKey":"User_8bbfe9ac-e2f7-43da-90bb-25d84f37f81a","userCode":"d326b","company":"N26","twitter":"LuciaP_86","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":102853,"name":"Hub Two","description":"","mapImageUrl":"","events":[{"id":103042,"name":"Full-Stack Kotlin","description":"Kotlin can be used for pretty much every part of your dev stack.  And that's exactly what we'll look at:\r\nBackend using Kotlin (we'll look at a couple of Kotlin web frameworks), Frontend (using Kotlin/Javascript support), Mobile (Kotlin for Android, of course), and build tools to tie it all together (Gradle-Kotlin or Kobalt).","category":null,"startDate":"09/25/2017 10:50AM","endDate":"09/25/2017 11:30AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":5670,"name":"Brent Watson","profile":"Brent Watson is an Sr. Android Engineer at Vimeo in NYC.  He is also a published author, enjoys speaking at conferences and meetups, and runs the NYC Kotlin meetup.  He was also the tech editor for Kotlin In Action amongst other Java books.  You can find him on twitter @brent_watson, and online at brentwatson.com","avatarKey":"http://static.sched.org/a4/1356590/avatar.jpg.320x320px.jpg?b95","userCode":"4125","company":"Vimeo","twitter":null,"linkedIn":null,"website":"brentwatson.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103108,"name":"Doppl","description":"Android-centric code sharing. Learn about how we're sharing a reactive Android architecture, with native Android libraries, on iOS. See how we built the iOS Droidcon app (aka Sad Puppy).","category":null,"startDate":"09/25/2017 05:00PM","endDate":"09/25/2017 05:40PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":5950,"name":"Kevin Galligan","profile":"President of touchlab and general Droidcon NYC content person.","avatarKey":"User_858846fa-fcee-4ff3-a278-f2a82ca77029","userCode":"0ecd","company":"Touch Lab","twitter":"kpgalligan","linkedIn":null,"website":"http://about.me/kpgalligan","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"f062a597-3522-481b-b1d8-4826ee4c934a_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":103004,"name":"Advanced Networking with RxJava + Retrofit","description":"Many introduction to RxJava talks have been given using the canonical example of talking to a REST API but, unfortunately, they don't often go into details on how this works in your greater application architecture. What if you need to show a loading indicator? What if you want to retry your requests? How does the request handle the Activity lifecycle? In this talk, Stephen tries to answer those questions and more with proven patterns for solving application-level problems with RxJava.","category":null,"startDate":"09/25/2017 02:20PM","endDate":"09/25/2017 03:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":12008,"name":"Stephen D'Amico","profile":"Android Tech Lead @ SeatGeek, previously Android Engineer @ ESPN. Computer Engineering @ UIowa. Wisconsin native.","avatarKey":"User_5fa865bb-f315-47ac-87c2-c2533bd7a1ae","userCode":"4dc7","company":"SeatGeek","twitter":"sddamico","linkedIn":null,"website":"blog.sddamico.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"930da3a3-8469-443f-b514-7f00958caed5_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":103038,"name":"ObjectBox - a fresh start for object persistence","description":"ObjectBox is a new database designed to simplify and speed up object persistence. Learn how you can achieve up to 10x performance on CRUD operations by dropping SQLite with its rows and columns approach. We will look into basic APIs, queries, interop with RxJava, and Kotlin support.\r\n\r\nAnother focus of the talk will be object references, where relational databases and object-oriented languages collide. SQLite-based ORMs struggle with object relations or don’t even support them. For ObjectBox, object relations are an essential part of the database and are mostly transparent in Java code: developers can choose to load relations lazily or eagerly.\r\n\r\nObjectBox also handles evolving data schemas differently than other databases. We will show how ObjectBox only relies on the class model. Accordingly, trivial data model changes require no (e.g. add/remove properties/entities) or little (e.g. renames) developer intervention.\r\n\r\nThe speaker Markus Junginger is the developer of ObjectBox and thus can give deep technical insights. He is also the developer behind the widely known open source libraries EventBus and greenDAO and can also share his experience in developing ORMs  with greenDAO being the second ORM he developed on top of SQLite.","category":null,"startDate":"09/25/2017 11:40AM","endDate":"09/25/2017 12:20PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":100000,"name":"Markus Junginger","profile":"Markus is the CTO of ObjectBox. Soon after Markus became one of the first Android app developers in 2007, he started open source libraries like EventBus and greenDAO. With 25,000 GitHub stars he’s among the top 1% of Java and Android developers. He’s a high performance fanatic and has an ongoing love/hate relationship with object persistence since he came across Hibernate in his previous life.","avatarKey":"User_e7c656a1-407d-4787-b028-1a6548678d81","userCode":"660a2","company":"ObjectBox","twitter":"https://twitter.com/greenrobot_de","linkedIn":"","website":"http://objectbox.io","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103036,"name":"O-mg what's new in Android Security?  ","description":"Android O brings a plethora of security enhancements to the platform and the SDK. This talk will give you a concise update on these new security features and any breaking changes as well as practical tips and examples of how to implement them and improve your app’s security.\r\n \r\nWe’ll cover features such as Auto fill, restrictions on device hardware identification with the focus on user privacy, new permissions in telephony and updates to how apps can access user accounts. \r\n \r\nWe’ll discuss the major enhancements to Webview in Android O including isolating it’s process and ability to integrate with Google Safe Browsing API. Also the dropping of support for SSLv3 and enhancements to Network security config that was introduced in Android Nougat.  \r\n \r\nThey’ll also be a focus on security features you can implement when your apps is not running on Android O. This where Google Play services can help. Several new SafteyNet APIs allow developers make smarter decisions about the trustworthiness of the devices their app is running on. Lastly we’ll cover how to easy it is to transition to Google Play App Signing which offers a new way to manage your app’s signing keys. ","category":null,"startDate":"09/25/2017 10:00AM","endDate":"09/25/2017 10:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":16913,"name":"Scott Alexander-Bown (scottyab)","profile":"Scott is a consultant Android developer who is passionate about mobile app security and recently joined the Google Developer Experts program. He is co-author of “The Android Security Cookbook”, speaks at various conferences on the subject and has released several security related open source libraries.\r\n\r\nIn 2011, Scott founded and continues to co-run SWmobile meetup group based in Bristol/Bath (UK). Mobile professionals can meet and share knowledge at the monthly tech talk/social events.\r\n\r\nTo relax and bug out from the screen Scott enjoys spending time with his wife and children, running, Mexican food, Belgian beer and science fiction.","avatarKey":"User_e5e3665a-dce8-49a6-b894-3b59deadb4aa","userCode":"5c20","company":"Self employed","twitter":"scottyab","linkedIn":null,"website":"https://scottyab.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":103102,"name":"Android Security, an Enterprise perspective","description":"Debunking Android security Myths with data\r\n\r\nAndroid has a poor reputation in the market around security. This is especially damaging in the Enterprise space where security is of prime importance. In this talk I will review data in several reports to highlight the reality of security in Android, changes Google has made to their tools and processes to enhance security, and best practices to demonstrate to Enterprise customers that Android apps the audience builds are secure.\r\nI will review how features introduced in Android 6.0, Google Mobile Services and third party extensions collaborate to provide to the market state of art solutions.\r\nThis talk will answer questions like:\r\n1. Android threats, real or FUD?\r\n2. Security updates, why are they critical for the Enterprise market\r\n3. Security and Long Life Cycle of Android devices, what are the market best practices\r\nAttendees will leave knowing how to speak the security and strength of the Android platform.","category":null,"startDate":"09/25/2017 04:10PM","endDate":"09/25/2017 04:50PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":104404,"name":"Chuck Bolen","profile":"Chuck Bolen is the Chief Architect for Mobile Computing Business at Zebra Technologies. Zebra builds rugged enterprise mobile computers using Android for use by retail, transportation, warehouse, healthcare and other industries. Chuck leads the technical strategy, design and is the main technical customer interface for OS Integration, security, device management and developer extensions for the Zebra Mobile Computing portfolio.","avatarKey":"User_c73a06b6-57ca-45a7-8624-ef6f309dcc84","userCode":"","company":"Zebra Technologies","twitter":"","linkedIn":"","website":"https://www.zebra.com/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":104402,"name":"Bill Hecox","profile":"Bill Hecox is an Android Developer Evangelist and technical communications specialist with Zebra Technologies. Along with providing development support to customers and partners via Zebra’s Developer Community, he also develops Android system utilities and tools featured on Zebra’s Android Devices.","avatarKey":"User_25ff3fa9-7278-4f2f-b4f0-caf646fc83ab","userCode":"","company":"Zebra Technologies","twitter":"billhecox","linkedIn":"","website":"https://www.zebra.com/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":104500,"name":"The Forum","description":"","mapImageUrl":"","events":[{"id":102900,"name":"Welcome","description":"Intro to Droidcon","category":null,"startDate":"09/25/2017 08:50AM","endDate":"09/25/2017 09:00AM","publicEvent":true,"rsvpCount":0,"speakers":[]},{"id":102901,"name":"Keynote: Illegitimi non carborundum","description":"More than just a job, people with long careers in tech do it for the love. This can look like something as simple as the delight in code running the first time it’s compiled, or as grandiose as thinking you can change the world, and leave it better than you found it. But change is hard, and haters gonna hate. What does it look like to stay in the game for the long haul? Meetup’s mobile engineering director Kathy Tafel hopes you’ll join her on this journey through some personal computing history and get fortified for the bumpy road ahead.","category":null,"startDate":"09/25/2017 09:00AM","endDate":"09/25/2017 09:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":80210,"name":"Kathy Tafel","profile":"Kathy Tafel loves learning, adopting, and creating new technology, and watching it move the human race forwards. She currently leads Meetup’s iOS and Android engineers as Director of Mobile Engineering. Kathy has launched multitudes of successful consumer computing efforts, including Android and iOS apps, web campaigns at Apple, and Mac digital audio workstation software. In her spare time, she facilitates the transmission of culture by fermenting kombucha and hosting Meetups.","avatarKey":"User_393e8e42-f643-4709-89d3-d5aec2c6d1fc","userCode":"3bc57","company":"Meetup","twitter":"kathytafel","linkedIn":"","website":"https://www.meetup.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]}],"blocks":[{"id":103403,"name":"Lunch","description":"","startDate":"09/25/2017 12:30PM","endDate":"09/25/2017 01:30PM"},{"id":103404,"name":"Comixology Prize Break","description":"","startDate":"09/25/2017 03:50PM","endDate":"09/25/2017 04:20PM"},{"id":103400,"name":"Break","description":"","startDate":"09/26/2017 10:30AM","endDate":"09/26/2017 11:00AM"},{"id":103402,"name":"Lunch","description":"","startDate":"09/26/2017 12:30PM","endDate":"09/26/2017 01:00PM"},{"id":103401,"name":"Comixology Prize Break","description":"","startDate":"09/26/2017 03:20PM","endDate":"09/26/2017 03:40PM"}]}
